Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/patterns/appfactories.po
Languages: fa

source: Application Factories
fa: کارخانه برنامه ها

source: If you are already using packages and blueprints for your application (:doc:`/blueprints`) there are a couple of really nice ways to further improve the experience. A common pattern is creating the application object when the blueprint is imported. But if you move the creation of this object into a function, you can then create multiple instances of this app later.
fa: اگر از قبل از بسته‌ها و طرح‌های اولیه برای برنامه خود استفاده می‌کنید ( :doc:`/blueprints` ) چند راه واقعاً خوب برای بهبود بیشتر تجربه وجود دارد. یک الگو زمانی برنامه ایجاد شی است که طرح اولیه وارد می شود. اما اگر ایجاد این شی را به یک تابع منتقل کنید، بعداً می توانید چندین نمونه از این برنامه را ایجاد کنید.

source: So why would you want to do this?
fa: پس چرا می خواهید این کار را انجام دهید؟

source: Testing. You can have instances of the application with different settings to test every case.
fa: آزمایش کردن. می توانید نمونه هایی از برنامه را با تنظیمات مختلف برای آزمایش هر مورد داشته باشید.

source: Multiple instances. Imagine you want to run different versions of the same application. Of course you could have multiple instances with different configs set up in your webserver, but if you use factories, you can have multiple instances of the same application running in the same application process which can be handy.
fa: نمونه های متعدد. تصور کنید می خواهید نسخه های مختلف یک برنامه را اجرا کنید. البته، می‌توانید چندین نمونه با پیکربندی‌های مختلف در وب سرور خود تنظیم کنید، اما اگر از کارخانه‌ها استفاده می‌کنید، می‌توانید چندین نمونه از یک برنامه را در یک فرآیند برنامه اجرا کنید که می‌تواند مفید باشد.

source: So how would you then actually implement that?
fa: پس چگونه واقعاً آن را اجرا می کنید؟

source: Basic Factories
fa: کارخانه های اساسی

source: The idea is to set up the application in a function. Like this::
fa: ایده، راه‌اندازی برنامه در یک تابع است. مانند این::

source: The downside is that you cannot use the application object in the blueprints at import time. You can however use it from within a request. How do you get access to the application with the config? Use :data:`~flask.current_app`::
fa: نکته منفی این است که نمی توانید در زمان وارد کردن از شی برنامه از طرح های اولیه استفاده کنید. با این حال می توانید از درون یک درخواست از آن استفاده کنید. چگونه با کانفیگ به برنامه دسترسی پیدا می کنید؟ استفاده از :data:`~flask.current_app` ::

source: Here we look up the name of a template in the config.
fa: در اینجا نام یک قالب را در پیکربندی جستجو می کنیم.

source: Factories & Extensions
fa: کارخانه ها و افزونه ها

source: It's preferable to create your extensions and app factories so that the extension object does not initially get bound to the application.
fa: ترجیحاً افزونه ها و کارخانه‌های برنامه خود را ایجاد کنید تا شیء افزونه در ابتدا به برنامه متصل نشود.

source: Using `Flask-SQLAlchemy <https://flask-sqlalchemy.palletsprojects.com/>`_, as an example, you should not do something along those lines::
fa: به عنوان مثال با استفاده از <https://flask-sqlalchemy.palletsprojects.com/>`_ ، شما نباید کاری را در این خط انجام دهید::

source: But, rather, in model.py (or equivalent)::
fa: اما، به جای آن، در model.py (یا معادل) اینکار را انجام دهید::

source: and in your application.py (or equivalent)::
fa: و در application.py (یا معادل آن) اینکار را انجام دهید::

source: Using this design pattern, no application-specific state is stored on the extension object, so one extension object can be used for multiple apps. For more information about the design of extensions refer to :doc:`/extensiondev`.
fa: با استفاده از این الگوی طراحی، هیچ حالت خاص برنامه در شیء افزونه ذخیره نمی شود، بنابراین یک شیء افزونه را می توان برای چندین برنامه استفاده کرد. برای اطلاعات بیشتر در مورد طراحی افزونه ها به :doc:`/extensiondev` مراجعه کنید.

source: Using Applications
fa: با استفاده از برنامه های کاربردی

source: To run such an application, you can use the :command:`flask` command:
fa: برای اجرای چنین برنامه ای می توانید از دستور :command:`flask` استفاده کنید:

source: Flask will automatically detect the factory (``create_app`` or ``make_app``) in ``myapp``. You can also pass arguments to the factory like this:
fa: فلاسک به طور خودکار کارخانه (``create_app`` یا ``make_app``) را در ``myapp`` شناسایی می کند. همچنین می توانید آرگومان هایی را به این صورت به کارخانه ارسال کنید:

source: Then the ``create_app`` factory in ``myapp`` is called with the string ``'dev'`` as the argument. See :doc:`/cli` for more detail.
fa: سپس کارخانه ``create_app`` در ``myapp`` با رشته ``'dev'`` به عنوان آرگومان فراخوانی می شود. برای جزئیات بیشتر به :doc:`/cli` مراجعه کنید.

source: Factory Improvements
fa: بهبود کارخانه

source: The factory function above is not very clever, but you can improve it. The following changes are straightforward to implement:
fa: عملکرد کارخانه بالا خیلی هوشمندانه نیست، اما می توانید آن را بهبود ببخشید. تغییرات زیر برای پیاده سازی سراست‌تر است:

source: Make it possible to pass in configuration values for unit tests so that you don't have to create config files on the filesystem.
fa: امکان رد کردن مقادیر پیکربندی برای تست های واحد را فراهم کنید تا مجبور نباشید فایل های پیکربندی را در سیستم فایل ایجاد کنید.

source: Call a function from a blueprint when the application is setting up so that you have a place to modify attributes of the application (like hooking in before/after request handlers etc.)
fa: هنگامی که برنامه در حال راه اندازی است، یک تابع را از یک طرح فراخوانی کنید تا جایی برای تغییر ویژگی های برنامه (مانند قلاب کردن کنترل کننده های درخواست قبل/بعد و غیره) داشته باشید.

source: Add in WSGI middlewares when the application is being created if necessary.
fa: در صورت لزوم، زمانی که برنامه در حال ایجاد است، میان افزارهای WSGI را اضافه کنید.
