Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/deploying/cgi.po
Languages: fa

source: If all other deployment methods do not work, CGI will work for sure. CGI is supported by all major servers but usually has a sub-optimal performance.
fa: اگر روش های دیگر deploy کار نکردند، CGI با اطمینان کار خواهد کرد. CGI توسط تمام سرورهای اصلی پشتیبانی می شود اما معمولاً عملکرد زیر بهینه ای دارد.

source: This is also the way you can use a Flask application on Google's `App Engine`_, where execution happens in a CGI-like environment.
fa: همچنین راهی است که شما می توانید یک برنامه فلاسک را در `App Engine`_ گوگل استفاده کنید، که در آن، اجرای برنامه در یک محیط شبیه CGI اتفاق می افتد.

source: Watch Out
fa: مراقب باشید

source: Please make sure in advance that any ``app.run()`` calls you might have in your application file are inside an ``if __name__ == '__main__':`` block or moved to a separate file. Just make sure it's not called because this will always start a local WSGI server which we do not want if we deploy that application to CGI / app engine.
fa: لطفاً از قبل اطمینان حاصل کنید که تماس های ''app.run()' که ممکن است در پرونده درخواست خود داشته باشید در داخل یک ''if __name__ == '__main__':'' بلوک یا به یک فایل جداگانه منتقل شده باشند. فقط مطمئن شوید که آن را صدا نزنید،چون که این همیشه یک سرور WSGI محلی را شروع می کند که ما نمی خواهیم (اگر ما می خواهیم برنامه را به اپ انجین CGI / دیپلوی کنیم ).

source: With CGI, you will also have to make sure that your code does not contain any ``print`` statements, or that ``sys.stdout`` is overridden by something that doesn't write into the HTTP response.
fa: با CGI، شما همچنین باید مطمئن شوید که کد شما شامل هر گونه اظهارات ''print'' نباشد، یا 'sys.stdout'' توسط چیزی لغو می شود و پاسخ HTTP نمی نویسد.

source: Creating a `.cgi` file
fa: ایجاد یک فایل '.cgi'

source: First you need to create the CGI application file. Let's call it :file:`yourapplication.cgi`::
fa: ابتدا شما نیاز به ایجاد فایل برنامه CGI دارید. فایل cgi را اینگونه نام گذاری کنید :file:'yourapplication.cgi'::

source: Server Setup
fa: راه اندازی سرور

source: Usually there are two ways to configure the server. Either just copy the ``.cgi`` into a :file:`cgi-bin` (and use `mod_rewrite` or something similar to rewrite the URL) or let the server point to the file directly.
fa: معمولاً دو راه برای کانفیگ سرور وجود دارد. یا فقط ''.cgi''را داخل :file:'cgi-bin' (و از 'mod_rewrite' یا چیزی شبیه به بازنویسی URL استفاده کنید) کپی کنید و یا اجازه دهید سرور با فایل به طور مستقیم در ارتباط باشد.

source: In Apache for example you can put something like this into the config:
fa: در آپاچی به عنوان مثال شما می توانید چیزی شبیه به این را در پیکربندی قرار دهید:

source: On shared webhosting, though, you might not have access to your Apache config. In this case, a file called ``.htaccess``, sitting in the public directory you want your app to be available, works too but the ``ScriptAlias`` directive won't work in that case:
fa: در وب هاستینگ (webhosting) مشترک، به هر حال ممکن است شما دسترسی به پیکربندی آپاچی خود را نداشته باشید. در این حالت، فایلی که نامش ''.htaccess است و در دایرکتوری عمومی برنامه ای که دارید ذخیره شده است، بیش از حد کار می کند اما دستورالعمل ''ScriptAlias'' در آن مورد کار نخواهد کرد:

source: For more information consult the documentation of your webserver.
fa: برای کسب اطلاعات بیشتر با مستندات سرویس دهنده وب خود مشورت کنید.
