Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/deploying/fastcgi.po
Languages: fa

source: FastCGI is a deployment option on servers like `nginx`_, `lighttpd`_, and `cherokee`_; see :doc:`uwsgi` and :doc:`wsgi-standalone` for other options. To use your WSGI application with any of them you will need a FastCGI server first. The most popular one is `flup`_ which we will use for this guide. Make sure to have it installed to follow along.
fa: FastCGI یک نوع استقرار در سرورهایی مانند `nginx`_ ، `lighttpd`_ و `cherokee`_ است. برای تنظیم های دیگر، :doc:`uwsgi` و :doc:`wsgi-standalone` را ببینید. برای استفاده از برنامه WSGI با هر یک از آنها، برای اولین بار نیاز به یک سرور FastCGI دارید. یکی از محبوب ترین نوع سرور ها `flup`_ است که ما در این راهنما از آن استفاده می کنیم. اطمینان حاصل کنید که آن را نصب شده به همراه دارید.

source: Watch Out
fa: مراقب باشید

source: Please make sure in advance that any ``app.run()`` calls you might have in your application file are inside an ``if __name__ == '__main__':`` block or moved to a separate file. Just make sure it's not called because this will always start a local WSGI server which we do not want if we deploy that application to FastCGI.
fa: لطفاً از قبل اطمینان حاصل کنید که تماس های ''app.run()'که ممکن است در پرونده درخواست خود داشته باشید در داخل یک ''if __name__ == '__main__':'' بلوک هستند یا به یک فایل جداگانه منتقل شده اند. فقط مطمئن شوید که آن را صدا نزنید، چرا که این همیشه یک سرور WSGI محلی که ما نمی خواهیم را اجرا می کند اگر که می خواهیم برنامه را در FastCGI مستقر کنیم.

source: Creating a `.fcgi` file
fa: ایجاد یک فایل '.fcgi'

source: First you need to create the FastCGI server file. Let's call it `yourapplication.fcgi`::
fa: اول شما نیاز به ایجاد فایل سرور FastCGI دارید. آن را 'yourapplication.fcgi' بنامید::

source: This is enough for Apache to work, however nginx and older versions of lighttpd need a socket to be explicitly passed to communicate with the FastCGI server. For that to work you need to pass the path to the socket to the :class:`~flup.server.fcgi.WSGIServer`::
fa: این برای کار کردن آپاچی کافی است، با این حال nginx و نسخه های قدیمی تر lighttpd نیاز به سوکت دارند تا با صراحت برای برقراری ارتباط با سرور FastCGI انتقال یابند. برای آن کار شما نیاز دارید تا آن مسیر را با سوکت :class:`~flup.server.fcgi.WSGIServer` رد کنید:

source: The path has to be the exact same path you define in the server config.
fa: مسیر باید دقیقا همان مسیری باشد که شما در پیکربندی سرور تعریف می کنید.

source: Save the :file:`yourapplication.fcgi` file somewhere you will find it again. It makes sense to have that in :file:`/var/www/yourapplication` or something similar.
fa: فایل file:'yourapplication.fcgi'را در جایی که شما دوباره بتوانید آن را پیدا کنید ذخیره کنید. منطقی است که در :file:'/var/www/yourapplication' یا در مسیری مشابه ذخیره شده باشد.

source: Make sure to set the executable bit on that file so that the servers can execute it:
fa: مطمئن شوید که بیت اجرایی را روی آن فایل تنظیم کنید تا سرورها آن را اجرا کنند:

source: Configuring Apache
fa: پیکربندی آپاچی

source: The example above is good enough for a basic Apache deployment but your `.fcgi` file will appear in your application URL e.g. ``example.com/yourapplication.fcgi/news/``. There are few ways to configure your application so that yourapplication.fcgi does not appear in the URL. A preferable way is to use the ScriptAlias and SetHandler configuration directives to route requests to the FastCGI server. The following example uses FastCgiServer to start 5 instances of the application which will handle all incoming requests::
fa: مثال بالا به اندازه کافی برای استقرار پایه ای آپاچی خوب است، اما فایل '.fcgi' شما در URL درخواست شما ظاهر خواهد شد. برای مثال ''example.com/yourapplication.fcgi/news/' . راه های کمی برای پیکربندی برنامه شما وجود دارد تا yourapplication.fcgi در URL ظاهر نشود. یک راه ترجیحی، استفاده از دستورالعمل های پیکربندی ScriptAlias و SetHandler برای مسیر درخواست ها به سرور FastCGI است. مثال زیر از FastCgiServer استفاده میکند برای شروع 5 نمونه از برنامه که تمام درخواست های دریافتی را بررسی می کنند::

source: These processes will be managed by Apache. If you're using a standalone FastCGI server, you can use the FastCgiExternalServer directive instead. Note that in the following the path is not real, it's simply used as an identifier to other directives such as AliasMatch::
fa: این فرایندها توسط آپاچی مدیریت خواهند شد. اگر از یک سرور مستقل FastCGI استفاده می کنید، می توانید به جای آن از دستورالعمل FastCgiExternalServer استفاده کنید. توجه داشته باشید که در مسیر زیر واقعی نیست، آن را به سادگی به عنوان یک شناسه به دستورالعمل های دیگر مانند AliasMatch استفاده می شود::

source: If you cannot set ScriptAlias, for example on a shared web host, you can use WSGI middleware to remove yourapplication.fcgi from the URLs. Set .htaccess::
fa: اگر نمی توانید ScriptAlias را برای مثال در یک میزبان وب مشترک تنظیم کنید، می توانید از میان افزار WSGI برای حذف yourapplication.fcgi از آدرس های اینترنتی استفاده کنید. Set .htaccess::

source: Set yourapplication.fcgi::
fa: تنظیم yourapplication.fcgi::

source: Configuring lighttpd
fa: پیکربندی lighttpd

source: A basic FastCGI configuration for lighttpd looks like that::
fa: پیکربندی ساده FastCGI برای lighttpd می تواند اینگونه باشد::

source: Remember to enable the FastCGI, alias and rewrite modules. This configuration binds the application to ``/yourapplication``. If you want the application to work in the URL root you have to work around a lighttpd bug with the :class:`~werkzeug.contrib.fixers.LighttpdCGIRootFix` middleware.
fa: به یاد داشته باشید که باید FastCGI، نام مستعار و بازنویسی ماژول را فعال کنید. این پیکربندی برنامه را به ``/yourapplication`` متصل می کند. اگر شما می خواهید نرم افزار در ریشه URL کار کند، شما باید به کار درمورد اشکال lighttpdا با :class:`~werkzeug.contrib.fixers.LighttpdCGIRootFix` middleware کار کنید.

source: Make sure to apply it only if you are mounting the application the URL root. Also, see the Lighty docs for more information on `FastCGI and Python <https://redmine.lighttpd.net/projects/lighttpd/wiki/Docs_ModFastCGI>`_ (note that explicitly passing a socket to run() is no longer necessary).
fa: اطمینان حاصل کنید که آن را فقط زمانی اعمال کنید که شما در حال نصب برنامه در ریشه URL هستید. همچنین، به اسناد Lighty برای کسب اطلاعات بیشتر در مورد `FastCGI و پایتون <https://redmine.lighttpd.net/projects/lighttpd/wiki/Docs_ModFastCGI>`_ مراجعه کنید (توجه داشته باشید که عبور صریح یک سوکت برای run() دیگر لازم نیست).

source: Configuring nginx
fa: پیکربندی nginx

source: Installing FastCGI applications on nginx is a bit different because by default no FastCGI parameters are forwarded.
fa: نصب برنامه های کاربردی FastCGI بر روی nginx کمی متفاوت است زیرا به طور پیش فرض هیچ پارامترهای FastCGI رو به جلو نیست.

source: A basic Flask FastCGI configuration for nginx looks like this::
fa: پیکربندی اساسی فلاسک FastCGI برای nginx اینگونه به نظر می رسد::

source: This configuration binds the application to ``/yourapplication``. If you want to have it in the URL root it's a bit simpler because you don't have to figure out how to calculate ``PATH_INFO`` and ``SCRIPT_NAME``::
fa: این پیکربندی برنامه را به ``/yourapplication`` متصل می کند. اگر شما می خواهید آن را در ریشه URL داشته باشید، کمی ساده تر است به خاطر اینکه لازم نیست که بدانید چگونه باید ``PATH_INFO`` و ``SCRIPT_NAME`` را محاسبه کنید::

source: Running FastCGI Processes
fa: اجرا کردن فرایندهای FastCGI

source: Since nginx and others do not load FastCGI apps, you have to do it by yourself. `Supervisor can manage FastCGI processes. <http://supervisord.org/configuration.html#fcgi-program-x-section-settings>`_ You can look around for other FastCGI process managers or write a script to run your `.fcgi` file at boot, e.g. using a SysV ``init.d`` script. For a temporary solution, you can always run the ``.fcgi`` script inside GNU screen. See ``man screen`` for details, and note that this is a manual solution which does not persist across system restart::
fa: از آنجا که nginx و دیگران برنامه های FastCGI را بارگذاری نمی کنند، شما باید این کار را خودتان انجام دهید. `سرپرست می تواند فرایندهای FastCGI را مدیریت کند. <http://supervisord.org/configuration.html#fcgi-program-x-section-settings>`_ شما می توانید از دیگر مدیران فرایند FastCGI استفاده کنید و یا یک اسکریپت برای اجرای فایل `.fcgi` خود در بوت بنویسید، به عنوان مانند با استفاده از اسکریپت SysV ``init.d''. برای یک راه حل موقتی، شما همیشه می توانید اسکریپت ``.fcgi`` را در داخل صفحه نمایش گنو اجرا کنید. برای جزئیات بیشتر ''صفحه نمایش مرد'' را ببینید، و توجه داشته باشید که این یک راه حل دستی است که در هنگام راه اندازی مجدد سیستم باقی نمی ماند::

source: Debugging
fa: اشکال زدایی

source: FastCGI deployments tend to be hard to debug on most web servers. Very often the only thing the server log tells you is something along the lines of "premature end of headers". In order to debug the application the only thing that can really give you ideas why it breaks is switching to the correct user and executing the application by hand.
fa: استقرار FastCGI در اکثر سرورهای وب تمایل دارد تا به سختی اشکال زدایی شود. خیلی وقت ها تنها چیزی که لاگ سرور به شما می گوید چیزی در امتداد خطوط "premature end of headers" است. به منظور اشکال زدایی از برنامه، تنها چیزی که واقعا می تواند به شما بگوید که چرا برنامه اجرا نمی شود، تعویض به کاربر صحیح و اجرای برنامه از سمت کاربر است.

source: This example assumes your application is called `application.fcgi` and that your web server user is `www-data`::
fa: این مثال فرض می کند که برنامه شما `application.fcgi` نام گذاری شده و کاربر وب سرور شما `www-data` است::

source: In this case the error seems to be "yourapplication" not being on the python path. Common problems are:
fa: در این حالت "yourapplication" خطا می دهد که در مسیر پایتون نیست. مشکلات رایج از این قرارند:

source: Relative paths being used. Don't rely on the current working directory.
fa: مسیرهای نسبی در حال استفاده است. به دایرکتوری فعلی کار تکیه نکنید.

source: The code depending on environment variables that are not set by the web server.
fa: کد وابسته به متغیرهای محیطی (environment variables) است که توسط وب سرور تنظیم نشده است.

source: Different python interpreters being used.
fa: مفسرهای مختلف پایتون در حال استفاده هستند.
