Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/contributing.po
Languages: fa

source: How to contribute to Flask
fa: چگونه در فلاسک مشارکت کنیم

source: Thank you for considering contributing to Flask!
fa: از توجه کردن شما به کمک به فلاسک ممنونیم!

source: Support questions
fa: سوال های پشتیبانی

source: Please don't use the issue tracker for this. The issue tracker is a tool to address bugs and feature requests in Flask itself. Use one of the following resources for questions about using Flask or issues with your own code:
fa: لطفا از ابزار ردیابی مشکل (issue tracker) برای این استفاده نکنید. ابرار ردیابی مشکل یک ابزار است که مکان باگ ها و درخواست قابلیت ها را در فلاسک نشان می دهد. از یکی از منابع آمده برای سوال های در مورد فلاسک یا مشکلات کد خود استفاده کنید:

source: The ``#questions`` channel on our Discord chat: https://discord.gg/pallets
fa: کانال ``#questions`` در دیسکورد ما : https://discord.gg/pallets

source: Ask on `Stack Overflow`_. Search with Google first using: ``site:stackoverflow.com flask {search term, exception message, etc.}``
fa: در `Stack Overflow`_ سوال خود را بپرسید. در گوگل جستجو کنید: ``site:stackoverflow.com flask {search term, exception message, etc.}``

source: Ask on our `GitHub Discussions`_ for long term discussion or larger questions.
fa: برای بحث طولانی مدت یا سؤالات بزرگتر را در `GitHub Discussions`_ از ما بپرسید

source: Reporting issues
fa: گزارش مشکلات

source: Include the following information in your post:
fa: موارد زیر را در پست خود جای دهید:

source: Describe what you expected to happen.
fa: توضیح دهید چگونه این اتفاق برای شما افتاد.

source: If possible, include a `minimal reproducible example`_ to help us identify the issue. This also helps check that the issue is not with your own code.
fa: اگر ممکن است، یک `مثال مشابه قابل تکثیر`_ بنویسید تا به ما کمک کنید. مشکل خود را شناسایی کنید. شناسایی مشکل هم کمک می کند تا بررسی کنید که مشکل از سمت کد شما نیست.

source: Describe what actually happened. Include the full traceback if there was an exception.
fa: توضیح دهید چگونه این اتفاق برای شما افتاد. جزئیات کامل را شرح دهید اگر با خطایی مواجه شدید.

source: List your Python and Flask versions. If possible, check if this issue is already fixed in the latest releases or the latest code in the repository.
fa: نسخه های پایتون و فلاسک خود را بنویسید. اگر ممکن است، چک کنید که آیا مشکل در آخرین نسخه رسمی یا آخرین نسخه مخزن حل شده است یا خیر.

source: Submitting patches
fa: اعمال پچ (patch) ها

source: If there is not an open issue for what you want to submit, prefer opening one for discussion before working on a PR. You can work on any issue that doesn't have an open PR linked to it or a maintainer assigned to it. These show up in the sidebar. No need to ask if you can work on an issue that interests you.
fa: اگر مشکلی برای آنچه می خواهید ارسال کنید وجود ندارد، یک مشکل جدید برای گفتگو قبل از کار بر روی پول ریکوئست (pull request) باز کنید. شما می توانید روی هر موضوعی کار کنید که یک پول ریکوئست باز مرتبط با آن یا یک مسئول اختصاص داده شده به آن ندارد. اینها در نوار کناری نشان داده می شوند. نیازی نیست بپرسید که آیا می توانید روی یک موضوع کار کنید که به آن علاقه مندید.

source: Include the following in your patch:
fa: موارد زیر را در پچ خود وارد کنید:

source: Use `Black`_ to format your code. This and other tools will run automatically if you install `pre-commit`_ using the instructions below.
fa: از `Black`_ استفاده کنید تا کد خود را فرمت و مرتب کنید. این ابزار و دیگر ابزار ها می توانند به صورت خودکار اجرا شوند اگر شما `pre-commit`_ را نصب کنید.

source: Include tests if your patch adds or changes code. Make sure the test fails without your patch.
fa: اگر پچ شما کدی را اضافه یا تغییر می دهد، کد را تست کنید. مطمئن شوید که تست بدون پچ شما با خطا مواجه می شود.

source: Update any relevant docs pages and docstrings. Docs pages and docstrings should be wrapped at 72 characters.
fa: هر گونه متن یا داک استرینگ (docstring) مرتبط را بروزرسانی کنید. هر سطر مستندات و داک استرینگ ها باید در 72 کاراکتر خلاصه شود.

source: Add an entry in ``CHANGES.rst``. Use the same style as other entries. Also include ``.. versionchanged::`` inline changelogs in relevant docstrings.
fa: یک ورودی در ``CHANGES.rst`` اضافه کنید. مانند دیگر ورودی ها از استایل مشابه استفاده کنید. همچنین ``.. versionchanged::`` در خط تغییرات داخل خطی مرتبط با داک استرینگ را اضافه کنید.

source: First time setup
fa: ستاپ برای اولین بار

source: Download and install the `latest version of git`_.
fa: آخرین نسخه گیت را `دانلود کنید`_.

source: Configure git with your `username`_ and `email`_.
fa: گیت خود را با `username`_ و `email`_ خود تنظیم کنید.

source: Make sure you have a `GitHub account`_.
fa: مطمئن شوید که یک `GitHub account`_ دارید.

source: Fork Flask to your GitHub account by clicking the `Fork`_ button.
fa: فلاسک را با فشردن دکمه `Fork`_ به اکانت گیت هاب خود فورک کنید.

source: `Clone`_ the main repository locally.
fa: مخزن اصلی را به صورت محلی `Clone`_ کنید.

source: Add your fork as a remote to push your work to. Replace ``{username}`` with your username. This names the remote "fork", the default Pallets remote is "origin".
fa: فورک خود را به عنوان یک ریموت برای ارسال تغییرات کار خود اضافه کنید. به جای ``{username}`` نام کاربری خود را جایگزین کنید. این ریموت "fork" شما را نام گذاری می کند, که ریموت پیش فرض پالت "origin" است.

source: Create a virtualenv.
fa: یک virtualenv ایجاد کنید.

source: Linux/macOS
fa: لینوکس / macOS

source: Windows
fa: ویندوز

source: Upgrade pip and setuptools.
fa: ابزار های pip و setuptools را بروزرسانی کنید.

source: Install the development dependencies, then install Flask in editable mode.
fa: پیش نیاز های برنامه را نصب کنید، سپس فلاسک را در حالت قابل ویرایش نصب کنید.

source: Install the pre-commit hooks.
fa: ابزار pre-commit را نصب کنید.

source: Start coding
fa: شروع کد نویسی

source: Create a branch to identify the issue you would like to work on. If you're submitting a bug or documentation fix, branch off of the latest ".x" branch.
fa: شاخه ای برای شناسایی مشکلی که می خواهید روی آن کار کنید ایجاد کنید. اگر شما در حال ارائه رفع اشکال و یا رفع مشکلات اسناد هستید، شاخه کردن از آخرین شاخه ".x" است.

source: If you're submitting a feature addition or change, branch off of the "main" branch.
fa: اگر شما در حال ارائه یک ویژگی و یا تغییر هستید، شاخه های دیگر از شاخه "main" منشا می گیرند.

source: Using your favorite editor, make your changes, `committing as you go`_.
fa: با استفاده از ویرایشگر مورد علاقه خود، تغییرات خود را ایجاد کنید و `کامیت کنید`_.

source: Include tests that cover any code changes you make. Make sure the test fails without your patch. Run the tests as described below.
fa: شامل تست هایی که هر گونه تغییرات کد شما را پوشش می دهد. مطمئن شوید که تست بدون پچ شما شکست می خورد و اجرا نمی شود. تست ها را همان طور که در زیر شرح داده شده اجرا کنید.

source: Push your commits to your fork on GitHub and `create a pull request`_. Link to the issue being addressed with ``fixes #123`` in the pull request.
fa: تغییرات خود را به fork خود در GitHub پوش کنید و `یک پول ریکوئست ایجاد کنید`_. در پول ریکوئست، مشکل را با ''fix #123'' لینک کنید.

source: Running the tests
fa: اجرای تست ها

source: Run the basic test suite with pytest.
fa: مجموعه تست های اولیه را با pytest اجرا کنید.

source: This runs the tests for the current environment, which is usually sufficient. CI will run the full suite when you submit your pull request. You can run the full test suite with tox if you don't want to wait.
fa: این کار تست ها را برای محیط فعلی اجرا می کند که معمولاً کافی است. CI مجموعه کامل را اجرا خواهد کرد زمانی که شما پول ریکوئست بزنید. شما می توانید مجموعه تست کامل با tox اجرا کنید اگر نمی خواهید که صبر کنید.

source: Running test coverage
fa: اجرا کردن تست ها

source: Generating a report of lines that do not have test coverage can indicate where to start contributing. Run ``pytest`` using ``coverage`` and generate a report.
fa: تولید یک گزارش از خطوط که تست را پوشش نمی دهند می تواند نشان بدهد که از کجا باید برای مشارکت شروع کنید.'pytest'' را با استفاده از ''coverage'' اجرا کرده و یک گزارش تولید کنید.

source: Open ``htmlcov/index.html`` in your browser to explore the report.
fa: ''htmlcov/index.html'' را در مرورگر خود باز کنید تا گزارش را ببینید.

source: Read more about `coverage <https://coverage.readthedocs.io>`__.
fa: اطلاعات بیشتر در مورد 'coverage <https://coverage.readthedocs.io>'__.

source: Building the docs
fa: ساخت اسناد

source: Build the docs in the ``docs`` directory using Sphinx.
fa: اسناد در دایرکتوری ''docs'' با استفاده از Sphinx بسازید.

source: Open ``_build/html/index.html`` in your browser to view the docs.
fa: ''_build/html/index.html'' را در مرورگر خود باز کنید تا اسناد را مشاهده کنید.

source: Read more about `Sphinx <https://www.sphinx-doc.org/en/stable/>`__.
fa: اطلاعات بیشتر در مورد 'sphinx <https://www.sphinx-doc.org/en/stable/>'__.
