Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/debugging.po
Languages: fa

source: Debugging Application Errors
fa: اشکال زدایی خطاهای برنامه

source: In Production
fa: در تولید

source: **Do not run the development server, or enable the built-in debugger, in a production environment.** The debugger allows executing arbitrary Python code from the browser. It's protected by a pin, but that should not be relied on for security.
fa: **سرور توسعه را اجرا نکنید یا اشکال زدا داخلی را در محیط تولید فعال نکنید.** دیباگر اجازه می دهد کد پایتون دلخواه را از مرورگر اجرا کنید. توسط یک پین محافظت می شود، اما برای امنیت نباید به آن اعتماد کرد.

source: Use an error logging tool, such as Sentry, as described in :ref:`error-logging-tools`, or enable logging and notifications as described in :doc:`/logging`.
fa: از یک ابزار ثبت خطا، مانند Sentry، همانطور که در :ref:`error-logging-tools` توضیح داده شده است استفاده کنید، یا ثبت و اعلان ها را همانطور که در :doc:`/logging` توضیح داده شده فعال کنید.

source: If you have access to the server, you could add some code to start an external debugger if ``request.remote_addr`` matches your IP. Some IDE debuggers also have a remote mode so breakpoints on the server can be interacted with locally. Only enable a debugger temporarily.
fa: اگر به سرور دسترسی دارید و ``request.remote_addr`` مطابق با IP شما باشد، می‌توانید کدی برای راه‌اندازی یک اشکال‌زدای خارجی اضافه کنید. برخی از اشکال زداهای IDE یک حالت راه دور نیز دارند، بنابراین نقاط شکست در سرور می توانند به صورت محلی با آنها تعامل داشته باشند. فقط یک دیباگر را به طور موقت فعال کنید.

source: The Built-In Debugger
fa: دیباگر داخلی

source: The built-in Werkzeug development server provides a debugger which shows an interactive traceback in the browser when an unhandled error occurs during a request. This debugger should only be used during development.
fa: سرور توسعه داخلی Werkzeug یک دیباگر را ارائه می دهد که در صورت بروز خطای کنترل نشده در طول یک درخواست، یک دیباگر را در مرورگر نشان می دهد. این دیباگر فقط باید در طول توسعه استفاده شود.

source: The debugger allows executing arbitrary Python code from the browser. It is protected by a pin, but still represents a major security risk. Do not run the development server or debugger in a production environment.
fa: دیباگر اجازه می دهد تا کد پایتون دلخواه را از مرورگر اجرا کنید. توسط یک پین محافظت می شود، اما همچنان یک خطر امنیتی بزرگ است. سرور توسعه یا دیباگر را در محیط تولید اجرا نکنید.

source: To enable the debugger, run the development server with the ``FLASK_ENV`` environment variable set to ``development``. This puts Flask in debug mode, which changes how it handles some errors, and enables the debugger and reloader.
fa: برای فعال کردن دیباگر، سرور توسعه را با متغیر محیطی ``FLASK_ENV`` که روی ``development`` تنظیم شده است اجرا کنید. این فلاسک را در حالت اشکال زدایی قرار می دهد، که نحوه رسیدگی به برخی از خطاها را تغییر می دهد و اشکال زدا و بارگذاری مجدد را فعال می کند.

source: Bash
fa: بش(Bash)

source: CMD
fa: سی ام دی(CMD)

source: Powershell
fa: پاورشل(Powershell)

source: ``FLASK_ENV`` can only be set as an environment variable. When running from Python code, passing ``debug=True`` enables debug mode, which is mostly equivalent. Debug mode can be controlled separately from ``FLASK_ENV`` with the ``FLASK_DEBUG`` environment variable as well.
fa: ``FLASK_ENV`` را فقط می توان به عنوان یک متغیر محیطی تنظیم کرد. هنگام اجرا از کد پایتون، ارسال ``debug=True`` حالت اشکال زدایی را فعال می کند، که اکثراً معادل است. حالت اشکال زدایی را می توان به طور جداگانه از ``FLASK_ENV`` با متغیر محیطی ``FLASK_DEBUG`` نیز کنترل کرد.

source: :doc:`/server` and :doc:`/cli` have more information about running the debugger, debug mode, and development mode. More information about the debugger can be found in the `Werkzeug documentation <https://werkzeug.palletsprojects.com/debug/>`__.
fa: :doc:`/server` و :doc:`/cli` اطلاعات بیشتری در مورد اجرای دیباگر، حالت اشکال زدایی و حالت توسعه دارند. اطلاعات بیشتر درباره اشکال‌زدا را می‌توانید در «مستندات `مستندات Werkzeug <https://werkzeug.palletsprojects.com/debug/>`__ بیابید.

source: External Debuggers
fa: اشکال زدای خارجی

source: External debuggers, such as those provided by IDEs, can offer a more powerful debugging experience than the built-in debugger. They can also be used to step through code during a request before an error is raised, or if no error is raised. Some even have a remote mode so you can debug code running on another machine.
fa: اشکال زداهای خارجی، مانند آنهایی که توسط IDE ها ارائه می شوند، می توانند تجربه اشکال زدایی قدرتمندتری نسبت به دیباگر داخلی ارائه دهند. همچنین می‌توان از آن‌ها برای گذر از کد در طول درخواست قبل از مطرح شدن خطا یا در صورت عدم بروز خطا استفاده کرد. برخی از آنها حتی یک حالت راه دور دارند تا بتوانید کدهای در حال اجرا روی دستگاه دیگری را اشکال زدایی کنید.

source: When using an external debugger, the app should still be in debug mode, but it can be useful to disable the built-in debugger and reloader, which can interfere.
fa: هنگام استفاده از یک اشکال‌زدای خارجی، برنامه همچنان باید در حالت اشکال‌زدایی باشد، اما غیرفعال کردن اشکال‌زدای داخلی و بارگذاری مجدد، که می‌تواند تداخل ایجاد کند، می‌تواند مفید باشد.

source: When running from the command line:
fa: هنگام اجرا از خط فرمان:

source: When running from Python:
fa: هنگام اجرا از پایتون:

source: Disabling these isn't required, an external debugger will continue to work with the following caveats. If the built-in debugger is not disabled, it will catch unhandled exceptions before the external debugger can. If the reloader is not disabled, it could cause an unexpected reload if code changes during debugging.
fa: غیرفعال کردن این موارد ضروری نیست، یک اشکال‌زدای خارجی با اخطارهای زیر به کار خود ادامه می‌دهد. اگر اشکال‌زدای داخلی غیرفعال نباشد، قبل از اینکه اشکال‌زدای خارجی بتواند استثنائات کنترل نشده را پیدا کند. اگر بارگذاری مجدد غیرفعال نباشد، اگر کد در حین اشکال زدایی تغییر کند، می تواند بارگیری مجدد غیرمنتظره ایجاد کند.
