Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/errorhandling.po
Languages: fa

source: Handling Application Errors
fa: مدیریت خطا های برنامه

source: Applications fail, servers fail. Sooner or later you will see an exception in production. Even if your code is 100% correct, you will still see exceptions from time to time. Why? Because everything else involved will fail. Here are some situations where perfectly fine code can lead to server errors:
fa: برنامه ها کار نمیکنند، سرور ها از کار می‌افتند. دیر یا زود شاهد یک استثنا در ارائه محصول خواهید بود. حتی اگر کد شما ۱۰۰% درست باشد هم گاهی استثنا ها را خواهید دید. چرا؟ چون هر چیزی که پیچیده است شکست خواهد خورد. در اینجا مواردی وجود دارد که حتی با وجود کد های کاملا دقیق، میتواند منجر به خطا های سرور شود:

source: the client terminated the request early and the application was still reading from the incoming data
fa: کلاینت درخواست را زودتر قطع کرد اما برنامه همچنان در حال خواندن داده های دریافتی بود

source: the database server was overloaded and could not handle the query
fa: سرور دیتا‌بیس اضافه بار داشت و نتواند کوئری ها را مدیریت کند

source: a filesystem is full
fa: یک فایل سیستم پر باشد

source: a harddrive crashed
fa: یک هارد‌ درایو خراب شود

source: a backend server overloaded
fa: به سرور بک‌اند اضافه بار وارد شود

source: a programming error in a library you are using
fa: یک ارور در کتابخانه ای که استفاده میکنید رخ دهد

source: network connection of the server to another system failed
fa: اتصال شبکه سرور به سیستم دیگری انجام نگرفت

source: And that's just a small sample of issues you could be facing. So how do we deal with that sort of problem? By default if your application runs in production mode, and an exception is raised Flask will display a very simple page for you and log the exception to the :attr:`~flask.Flask.logger`.
fa: و این ها فقط چند نمونه کوچک از مشکلاتی است که ممکن است با آن روبرو شوید. پس چگونه با این نوع مشکلات برخورد کنیم؟ به صورت پیشفرض، اگر برنامه در حالت ارائه اجرا شود و یک استثنا مطرح شود، فلاسک صفحه بسیار ساده ای را براری شما نمایش می‌دهد و استثنا را در :attr:`~flask.Flask.logger` ثبت می‌کند.

source: But there is more you can do, and we will cover some better setups to deal with errors including custom exceptions and 3rd party tools.
fa: ولی میتوانید کار های بیشتری انجام دهید. ما تنظیمات بهتری را برای مقابله با خطا ها از جمله استثنا های سفارشی و ابزار های شخص ثالث پوشش خواهیم داد.

source: Error Logging Tools
fa: ابزار های واقعه‌نگاری ارور ها

source: Sending error mails, even if just for critical ones, can become overwhelming if enough users are hitting the error and log files are typically never looked at. This is why we recommend using `Sentry <https://sentry.io/>`_ for dealing with application errors. It's available as a source-available project `on GitHub <https://github.com/getsentry/sentry>`_ and is also available as a `hosted version <https://sentry.io/signup/>`_ which you can try for free. Sentry aggregates duplicate errors, captures the full stack trace and local variables for debugging, and sends you mails based on new errors or frequency thresholds.
fa: ارسال ایمیل های حاوی خطا، حتی اگر فقط برای ایمیل های مهم باشد، در صورتی که کاربران کافی به خطا برخورد کنند و فایل های گزارش نیز هرگز تا الان بررسی نشده باشند، میتواند طاقت‌فرسا شود. به همین دلیل است که توصیه میکنیم از `Sentry <https://sentry.io/>`_ برای مقابله با خطا های برنامه استفاده کنید. این به عنوان یک پروژه به صورت متن باز در `گیت‌هاب <https://github.com/getsentry/sentry>`_ در دسترس است و همچنین میتوانید یک `نسخه برای میزبانی <https://sentry.io/signup/>`_ را به صورت رایگان امتحان کنید. Sentry خطا های تکراری را جمع آوری می‌کند، ردیابی پشته های کامل و متغیر های محلی را برای اشکال زدایی ضبط می‌کند و بر اساس خطا های جدید یا آستانه تکرار، ایمیل هایی را برای شما ارسال می‌کند.

source: To use Sentry you need to install the ``sentry-sdk`` client with extra ``flask`` dependencies.
fa: برای استفاده از Sentry باید کلاینت ``sentry-sdk`` را با وابستگی اضافی ``flask`` نصب کنید.

source: And then add this to your Flask app:
fa: و سپس این را به برنامه فلاسک خود اضافه کنید:

source: The ``YOUR_DSN_HERE`` value needs to be replaced with the DSN value you get from your Sentry installation.
fa: ``YOUR_DSN_HERE`` باید با مقدار DSN ای که از نصب Sentry دریافت می‌کنید، جایگزین شود.

source: After installation, failures leading to an Internal Server Error are automatically reported to Sentry and from there you can receive error notifications.
fa: پس از نصب، خرابی هایی که منجر به خطای سرور داخلی می‌شوند به طور خودکار به Sentry گزارش داده می شوند و از آنجا میتوانید اعلان های خطا را دریافت کنید.

source: See also:
fa: همچنین ببینید:

source: Sentry also supports catching errors from a worker queue (RQ, Celery, etc.) in a similar fashion. See the `Python SDK docs <https://docs.sentry.io/platforms/python/>`__ for more information.
fa: Sentry همچنین از دریافت خطاها از ایجاد کننده های صف (RQ، Celery و غیره) به روشی مشابه پشتیبانی می کند. برای اطلاعات بیشتر به `اسناد SDK پایتون <https://docs.sentry.io/platforms/python/>`__ مراجعه کنید.

source: `Getting started with Sentry <https://docs.sentry.io/quickstart/?platform=python>`__
fa: `شروع کار با Sentry <https://docs.sentry.io/quickstart/?platform=python>`__

source: `Flask-specific documentation <https://docs.sentry.io/platforms/python/guides/flask/>`__
fa: `مستندات مخصوص فلاسک <https://docs.sentry.io/platforms/python/guides/flask/>`__

source: Error Handlers
fa: کنترل کننده خطا ها

source: When an error occurs in Flask, an appropriate `HTTP status code <https://developer.mozilla.org/en-US/docs/Web/HTTP/Status>`__ will be returned. 400-499 indicate errors with the client's request data, or about the data requested. 500-599 indicate errors with the server or application itself.
fa: هنگامی که خطایی در فلاسک رخ می دهد، `کد وضعیت HTTP <https://developer.mozilla.org/en-US/docs/Web/HTTP/Status>`__ مناسب برگردانده می شود. کد های ۴۰۰ تا ۴۹۹ خطاهایی را که در داده های درخواست کلاینت یا داده های درخواست شده وجود دارد نشان می دهد و ۵۰۰ تا ۵۹۹ خطاهای خود سرور یا برنامه را نشان می دهد.

source: You might want to show custom error pages to the user when an error occurs. This can be done by registering error handlers.
fa: ممکن است بخواهید در صورت بروز خطا، صفحات خطای سفارشی را به کاربر نشان دهید. این را می توان با ثبت کنترل کننده های خطا انجام داد.

source: An error handler is a function that returns a response when a type of error is raised, similar to how a view is a function that returns a response when a request URL is matched. It is passed the instance of the error being handled, which is most likely a :exc:`~werkzeug.exceptions.HTTPException`.
fa: کنترل کننده خطا تابعی است که وقتی یک نوع خطا مطرح می‌شود، پاسخی را برمی‌گرداند. این شبیه view تابعی است که وقتی URL درخواستی مطابقت دارد، پاسخی را بر میگرداند. خطا های در حال رسیدگی ممکن است از یک :exc:`~werkzeug.exceptions.HTTPException` باشد.

source: The status code of the response will not be set to the handler's code. Make sure to provide the appropriate HTTP status code when returning a response from a handler.
fa: کد وضعیت پاسخ روی کد کنترل کننده تنظیم نمی شود. مطمئن شوید که کد وضعیت HTTP مناسب را هنگام بازگرداندن پاسخ از یک کنترل کننده ارائه می‌دهید.

source: Registering
fa: ثبت

source: Register handlers by decorating a function with :meth:`~flask.Flask.errorhandler`. Or use :meth:`~flask.Flask.register_error_handler` to register the function later. Remember to set the error code when returning the response.
fa: با دیکوراتور :meth:`~flask.Flask.errorhandler` یک تابع را به عنوان کنترل کننده یا از :meth:`~flask.Flask.register_error_handler` برای ثبت تابع بعدی استفاده کنید. به یاد داشته باشید که کد‌خطا را هنگام برگداندن پاسخ، تنظیم کنید.

source: :exc:`werkzeug.exceptions.HTTPException` subclasses like :exc:`~werkzeug.exceptions.BadRequest` and their HTTP codes are interchangeable when registering handlers. (``BadRequest.code == 400``)
fa: زیرکلاس های :exc:`werkzeug.exceptions.HTTPException` مانند :exc:`~werkzeug.exceptions.BadRequest` و کدهای HTTP آنها هنگام ثبت کنترل کننده ها قابل تعویض هستند. ( ``BadRequest.code == 400`` )

source: Non-standard HTTP codes cannot be registered by code because they are not known by Werkzeug. Instead, define a subclass of :class:`~werkzeug.exceptions.HTTPException` with the appropriate code and register and raise that exception class.
fa: کدهای غیر استاندارد HTTP را نمی توان به عنوان کد ثبت کرد زیرا توسط Werkzeug شناخته شده نیستند. در عوض، یک زیر کلاس از :class:`~werkzeug.exceptions.HTTPException` با کد مناسب تعریف کنید و آن کلاس استثنا را ثبت و بالا ببرید.

source: Handlers can be registered for any exception class, not just :exc:`~werkzeug.exceptions.HTTPException` subclasses or HTTP status codes. Handlers can be registered for a specific class, or for all subclasses of a parent class.
fa: کنترل کننده ها را می‌توان برای هر کلاس استثنا شده ثبت کرد، نه فقط زیر کلاس‌های :exc:`~werkzeug.exceptions.HTTPException` یا کدهای وضعیت HTTP. هندلرها را می توان برای یک کلاس خاص یا برای همه زیر کلاس های یک کلاس والد ثبت کرد.

source: Handling
fa: مدیریت

source: When building a Flask application you *will* run into exceptions. If some part of your code breaks while handling a request (and you have no error handlers registered), a "500 Internal Server Error" (:exc:`~werkzeug.exceptions.InternalServerError`) will be returned by default. Similarly, "404 Not Found" (:exc:`~werkzeug.exceptions.NotFound`) error will occur if a request is sent to an unregistered route. If a route receives an unallowed request method, a "405 Method Not Allowed" (:exc:`~werkzeug.exceptions.MethodNotAllowed`) will be raised. These are all subclasses of :class:`~werkzeug.exceptions.HTTPException` and are provided by default in Flask.
fa: هنگام ساختن یک برنامه فلاسک، با استثناهایی *مواجه* خواهید شد. اگر هنگام رسیدگی به درخواست، بخشی از کد شما خراب باشد (و هیچ کنترل کننده خطا ثبت نشده باشد)، یک "500 Internal Server Error" ( :exc:`~werkzeug.exceptions.InternalServerError` ) به طور پیش فرض برگردانده می شود. به طور مشابه، اگر درخواستی به یک مسیر ثبت نشده ارسال شود، خطای "404 Not Found" (:exc:`~werkzeug.exceptions.NotFound`) رخ می دهد. اگر مسیری یک روش درخواست غیرمجاز دریافت کند، یک "405 Method Not Allowed" (:exc:`~werkzeug.exceptions.MethodNotAllowed`) برگردانده می شود. اینها همه زیر کلاس های :class:`~werkzeug.exceptions.HTTPException` هستند و به طور پیش فرض در فلاسک ارائه می شوند.

source: Flask gives you the ability to raise any HTTP exception registered by Werkzeug. However, the default HTTP exceptions return simple exception pages. You might want to show custom error pages to the user when an error occurs. This can be done by registering error handlers.
fa: فلاسک به شما این امکان را می دهد که هر استثنای HTTP ثبت شده توسط Werkzeug را افزایش دهید. با این حال، استثناهای HTTP پیش‌فرض، صفحات استثنای ساده را برمی‌گردانند. ممکن است بخواهید در صورت بروز خطا، صفحات خطای سفارشی را به کاربر نشان دهید. این را می توان با ثبت کنترل کننده های خطا انجام داد.

source: When Flask catches an exception while handling a request, it is first looked up by code. If no handler is registered for the code, Flask looks up the error by its class hierarchy; the most specific handler is chosen. If no handler is registered, :class:`~werkzeug.exceptions.HTTPException` subclasses show a generic message about their code, while other exceptions are converted to a generic "500 Internal Server Error".
fa: هنگامی که فلاسک در حین رسیدگی به یک درخواست، استثنایی را می گیرد، ابتدا با کد جست و جو میشود. اگر هیچ کنترل کننده ای برای کد ثبت نشده باشد، فلاسک خطا را بر اساس سلسله مراتب کلاس خود جستجو می کند. خاص ترین کنترل کننده انتخاب می شود. اگر کنترل‌کننده‌ای ثبت نشده باشد، زیر کلاس‌های :class:`~werkzeug.exceptions.HTTPException` یک پیام عمومی در مورد کد خود نشان می‌دهند، در حالی که سایر استثناها به یک "500 Internal Server Error" عمومی تبدیل می‌شوند.

source: For example, if an instance of :exc:`ConnectionRefusedError` is raised, and a handler is registered for :exc:`ConnectionError` and :exc:`ConnectionRefusedError`, the more specific :exc:`ConnectionRefusedError` handler is called with the exception instance to generate the response.
fa: به عنوان مثال، اگر نمونه ای از :exc:`ConnectionRefusedError` مطرح شود، و یک کنترل کننده برای :exc:`ConnectionError` و :exc:`ConnectionRefusedError` ثبت شود، کنترل کننده خاص تر :class:`~werkzeug.exceptions.HTTPException` با نمونه استثنایی برای تولید پاسخ است.

source: Handlers registered on the blueprint take precedence over those registered globally on the application, assuming a blueprint is handling the request that raises the exception. However, the blueprint cannot handle 404 routing errors because the 404 occurs at the routing level before the blueprint can be determined.
fa: کنترل‌کننده‌های ثبت‌شده در طرح اولیه بر آن‌هایی که در سطح سراسری(global) در برنامه ثبت شده‌اند، اولویت دارند، با این فرض که یک طرح در حال رسیدگی به درخواستی است که استثنا را ایجاد می‌کند. با این حال، طرح اولیه نمی تواند خطاهای مسیریابی 404 را مدیریت کند زیرا 404 قبل از تعیین نقشه در سطح مسیریابی رخ می دهد.

source: Generic Exception Handlers
fa: کنترل کننده های استثنای عمومی

source: It is possible to register error handlers for very generic base classes such as ``HTTPException`` or even ``Exception``. However, be aware that these will catch more than you might expect.
fa: ثبت کنترل‌کننده‌های خطا برای کلاس‌های پایه بسیار عمومی مانند ``HTTPException`` یا حتی ``Exception`` امکان‌پذیر است. با این حال، توجه داشته باشید که این موارد بیشتر از آنچه انتظار دارید می گیرند.

source: For example, an error handler for ``HTTPException`` might be useful for turning the default HTML errors pages into JSON. However, this handler will trigger for things you don't cause directly, such as 404 and 405 errors during routing. Be sure to craft your handler carefully so you don't lose information about the HTTP error.
fa: برای مثال، یک کنترل کننده خطا برای ``HTTPException`` ممکن است برای تبدیل صفحات پیش‌فرض خطاهای HTML به JSON مفید باشد. با این حال، این کنترل کننده برای مواردی که شما مستقیماً ایجاد نمی کنید، مانند خطاهای 404 و 405 در طول مسیریابی، فعال می شود. حتماً کنترلر خود را با دقت طراحی کنید تا اطلاعات مربوط به خطای HTTP را از دست ندهید.

source: An error handler for ``Exception`` might seem useful for changing how all errors, even unhandled ones, are presented to the user. However, this is similar to doing ``except Exception:`` in Python, it will capture *all* otherwise unhandled errors, including all HTTP status codes.
fa: یک کنترل کننده خطا برای ``Exception`` ممکن است برای تغییر نحوه ارائه همه خطاها، حتی خطاهای کنترل نشده، به کاربر مفید به نظر برسد. با این حال، این شبیه به انجام ``except Exception:`` در پایتون است، *همه* خطاهای غیرقابل کنترل، از جمله همه کدهای وضعیت HTTP را می گیرد.

source: In most cases it will be safer to register handlers for more specific exceptions. Since ``HTTPException`` instances are valid WSGI responses, you could also pass them through directly.
fa: در بیشتر موارد، ثبت کنترل کننده ها برای استثناهای خاص تر ایمن تر خواهد بود. از آنجایی که نمونه‌های ``HTTPException`` پاسخ‌های معتبر WSGI هستند، می‌توانید مستقیماً آنها را نیز ارسال کنید.

source: Error handlers still respect the exception class hierarchy. If you register handlers for both ``HTTPException`` and ``Exception``, the ``Exception`` handler will not handle ``HTTPException`` subclasses because it the ``HTTPException`` handler is more specific.
fa: کنترل کننده های خطا همچنان به سلسله مراتب کلاس exception احترام می گذارند. اگر کنترل‌کننده‌ها را برای ``HTTPException`` و ``Exception`` ثبت کنید، کنترل‌کننده ``Exception`` زیرکلاس‌های ``HTTPException`` را کنترل نمی‌کند زیرا کنترل‌کننده ``HTTPException`` خاص‌تر هستند.

source: Unhandled Exceptions
fa: استثناهای کنترل نشده

source: When there is no error handler registered for an exception, a 500 Internal Server Error will be returned instead. See :meth:`flask.Flask.handle_exception` for information about this behavior.
fa: هنگامی که کنترل کننده خطا برای یک استثنا ثبت نشده است، به جای آن یک خطای سرور داخلی 500 برگردانده می شود. برای اطلاعات در مورد این رفتار به :meth:`flask.Flask.handle_exception` مراجعه کنید.

source: If there is an error handler registered for ``InternalServerError``, this will be invoked. As of Flask 1.1.0, this error handler will always be passed an instance of ``InternalServerError``, not the original unhandled error.
fa: اگر یک کنترل کننده خطا برای ``InternalServerError`` ثبت شده باشد، این مورد فراخوانی می شود. از فلاسک 1.1.0، این کنترل کننده خطا همیشه یک نمونه از ``InternalServerError`` ارسال می شود، نه خطای کنترل نشده اصلی.

source: The original error is available as ``e.original_exception``.
fa: خطای اصلی به عنوان ``e.original_exception`` موجود است.

source: An error handler for "500 Internal Server Error" will be passed uncaught exceptions in addition to explicit 500 errors. In debug mode, a handler for "500 Internal Server Error" will not be used. Instead, the interactive debugger will be shown.
fa: یک کنترل کننده خطا برای "500 Internal Server Error" علاوه بر خطاهای ۵۰۰ صریح، به استثناهای غیرقابل کشف منتقل می شود. در حالت اشکال زدایی، یک کنترل کننده برای "500 Internal Server Error" استفاده نخواهد شد. در عوض، دیباگر تعاملی نشان داده خواهد شد.

source: Custom Error Pages
fa: صفحات خطای سفارشی

source: Sometimes when building a Flask application, you might want to raise a :exc:`~werkzeug.exceptions.HTTPException` to signal to the user that something is wrong with the request. Fortunately, Flask comes with a handy :func:`~flask.abort` function that aborts a request with a HTTP error from werkzeug as desired. It will also provide a plain black and white error page for you with a basic description, but nothing fancy.
fa: گاهی اوقات هنگام ساختن یک برنامه فلاسک، ممکن است بخواهید یک :exc:`~werkzeug.exceptions.HTTPException` را مطرح کنید تا به کاربر علامت دهد که مشکلی در درخواست وجود دارد. خوشبختانه، فلاسک دارای یک تابع مفید :func:`~flask.abort` است که درخواستی با خطای HTTP از werkzeug را به دلخواه لغو می کند. همچنین یک صفحه خطای سیاه و سفید ساده با توضیحات اولیه برای شما ارائه می دهد، اما هیچ چیز جالبی نیست.

source: Depending on the error code it is less or more likely for the user to actually see such an error.
fa: بسته به کد خطا، احتمال اینکه کاربر واقعاً چنین خطایی را ببیند، کم یا زیاد است.

source: Consider the code below, we might have a user profile route, and if the user fails to pass a username we can raise a "400 Bad Request". If the user passes a username and we can't find it, we raise a "404 Not Found".
fa: کد زیر را در نظر بگیرید، ممکن است یک مسیر پروفایل کاربری داشته باشیم، و اگر کاربر نتواند یک نام کاربری را ارسال کند، می توانیم یک "400 Bad Request" ارسال کنیم. اگر کاربر یک نام کاربری را ارسال کند و ما نتوانیم آن را پیدا کنیم، "404 Not Found" را بر می گردانیم.

source: Here is another example implementation for a "404 Page Not Found" exception:
fa: در اینجا مثال دیگری برای اجرای استثنای "404 Page Not Found" آمده است:

source: When using :doc:`/patterns/appfactories`:
fa: هنگام استفاده از :doc:`/patterns/appfactories` :

source: An example template might be this:
fa: یک نمونه الگو میتواند شبیه این باشد:

source: Further Examples
fa: مثال های بیشتر

source: The above examples wouldn't actually be an improvement on the default exception pages. We can create a custom 500.html template like this:
fa: مثال‌های بالا در واقع بهبودی در صفحات استثنای پیش‌فرض نیستند. ما می توانیم یک الگوی سفارشی 500.html مانند این ایجاد کنیم:

source: It can be implemented by rendering the template on "500 Internal Server Error":
fa: می توان آن را با رندر کردن قالب روی "500 Internal Server Error" پیاده سازی کرد:

source: When using :doc:`/blueprints`:
fa: هنگام استفاده از :doc:`/blueprints` :

source: Blueprint Error Handlers
fa: کنترل کننده های خطا در Blueprint

source: In :doc:`/blueprints`, most error handlers will work as expected. However, there is a caveat concerning handlers for 404 and 405 exceptions. These error handlers are only invoked from an appropriate ``raise`` statement or a call to ``abort`` in another of the blueprint's view functions; they are not invoked by, e.g., an invalid URL access.
fa: در :doc:`/blueprints` ، اکثر کنترل کننده های خطا همانطور که انتظار می رود کار می کنند. با این حال، یک هشدار در مورد کنترل کننده ها برای استثناهای 404 و 405 وجود دارد. این کنترل‌کننده‌های خطا فقط از یک عبارت ``raise`` مناسب یا فراخوانی ``abort`` در یکی از توابع blueprint فراخوانی می‌شوند نه توسط دسترسی به URL نامعتبر.

source: This is because the blueprint does not "own" a certain URL space, so the application instance has no way of knowing which blueprint error handler it should run if given an invalid URL. If you would like to execute different handling strategies for these errors based on URL prefixes, they may be defined at the application level using the ``request`` proxy object.
fa: این به این دلیل است که طرح دارای یک فضای URL خاص نیست، بنابراین نمونه برنامه راهی برای دانستن اینکه در صورت داشتن URL نامعتبر باید کدام یک از کنترل کننده خطای طرح را اجرا کند، ندارد. اگر می‌خواهید استراتژی‌های مدیریت متفاوتی را برای این خطاها بر اساس پیشوندهای URL اجرا کنید، ممکن است آنها در سطح برنامه با استفاده از شی پراکسی ``request`` تعریف شوند.

source: Returning API Errors as JSON
fa: برگرداندن خطاهای API به صورت JSON

source: When building APIs in Flask, some developers realise that the built-in exceptions are not expressive enough for APIs and that the content type of :mimetype:`text/html` they are emitting is not very useful for API consumers.
fa: هنگام ساختن APIها در فلاسک، برخی از توسعه دهندگان متوجه می شوند که استثناهای داخلی به اندازه کافی برای API ها گویا نیستند و :mimetype:`text/html` که منتشر می کنند برای مصرف کنندگان API چندان مفید نیست.

source: Using the same techniques as above and :func:`~flask.json.jsonify` we can return JSON responses to API errors. :func:`~flask.abort` is called with a ``description`` parameter. The error handler will use that as the JSON error message, and set the status code to 404.
fa: با استفاده از تکنیک‌های مشابه بالا و :func:`~flask.json.jsonify` می‌توانیم پاسخ‌های JSON را به خطاهای API برگردانیم. :func:`~flask.abort` با پارامتر ``description`` فراخوانی می شود. کنترل کننده خطا از آن به عنوان پیام خطای JSON استفاده می کند و کد وضعیت را روی 404 تنظیم می کند.

source: We can also create custom exception classes. For instance, we can introduce a new custom exception for an API that can take a proper human readable message, a status code for the error and some optional payload to give more context for the error.
fa: ما همچنین می توانیم کلاس های استثنای سفارشی ایجاد کنیم. به عنوان مثال، می‌توانیم یک استثنای سفارشی جدید برای یک API معرفی کنیم که می‌تواند یک پیام قابل خواندن توسط انسان، یک کد وضعیت برای خطا و مقداری بار اختیاری برای ارائه زمینه بیشتر برای خطا دریافت کند.

source: This is a simple example:
fa: یک مثال ساده:

source: A view can now raise that exception with an error message. Additionally some extra payload can be provided as a dictionary through the `payload` parameter.
fa: اکنون یک view می تواند آن استثنا را با یک پیام خطا ایجاد کند. علاوه بر این، برخی از محموله های اضافی را می توان به عنوان dictionary از طریق پارامتر `payload` ارائه کرد.

source: Logging
fa: لاگ کردن

source: See :doc:`/logging` for information about how to log exceptions, such as by emailing them to admins.
fa: برای اطلاعات در مورد نحوه ثبت استثناها، مانند ارسال ایمیل به مدیران، به :doc:`/logging` مراجعه کنید.

source: Debugging
fa: اشکال زدایی

source: See :doc:`/debugging` for information about how to debug errors in development and production.
fa: برای اطلاعات در مورد نحوه اشکال زدایی خطاها در توسعه و تولید به :doc:`/debugging` مراجعه کنید.
