Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/foreword.po
Languages: fa

source: Foreword
fa: پیشگفتار

source: Read this before you get started with Flask. This hopefully answers some questions about the purpose and goals of the project, and when you should or should not be using it.
fa: این را قبل از شروع فلاسک بخوانید. امید است که این متن بتواند پاسخی برای سوالات شما درباره مقصود و هدف این پروژه داشته باشد و متوجه شوید که کِی از فلاسک استفاده کنید و کِی استفاده نکنید.

source: What does "micro" mean?
fa: معنی «کوچک» چیست؟

source: “Micro” does not mean that your whole web application has to fit into a single Python file (although it certainly can), nor does it mean that Flask is lacking in functionality. The "micro" in microframework means Flask aims to keep the core simple but extensible. Flask won't make many decisions for you, such as what database to use. Those decisions that it does make, such as what templating engine to use, are easy to change. Everything else is up to you, so that Flask can be everything you need and nothing you don't.
fa: «کوچک» به این معنا نیست که کل برنامه وب شما در یک فایل پایتون جای بگیرد(اگر چه شدنی است) و همچنین به این معنی نیست که فلاسک ناکاراست. «کوچک» در چارچوب کوچک (micro-framework) به این معنی است که فلاسک قصد دارد هسته را ساده اما قابل توسعه نگه دارد. فلاسک برای شما تصمیم نمیگیرد برای مثال شما از کدام دیتا بیس استفاده کنید.تصمیماتی که می گیرد، مانند اینکه از چه موتور قالبی استفاده شود (که به راحتی قابل تغییر است) بقیه چیزها به شما بستگی دارد، به طوری که فلاسک می تواند چیزی باشد که شما نیاز دارید و چیزی که شما آن را انجام نمی‌دهید.

source: By default, Flask does not include a database abstraction layer, form validation or anything else where different libraries already exist that can handle that. Instead, Flask supports extensions to add such functionality to your application as if it was implemented in Flask itself. Numerous extensions provide database integration, form validation, upload handling, various open authentication technologies, and more. Flask may be "micro", but it's ready for production use on a variety of needs.
fa: به صورت پیشفرض فلاسک دارای هیچ لایه انتزاعی دیتا بیس، فرم اعتبار سنجی یا هرچیزی دیگری نیست. در حال حاضر کتابخانه های مختلفی وجود دارد که آن کار ها را بتوانند انجام دهد.در عوض، فلاسک از برنامه های افزودنی پشتیبانی میکند تا عملکردی را به برنامه شما اضافه کند که انگار در خود فلاسک پیاده سازی شده است.افزونه‌های متعدد یکپارچه‌سازی پایگاه داده، اعتبارسنجی فرم، مدیریت فایل، فناوری‌ های مختلف احراز هویت و غیره را فراهم می‌کنند. فلاسک شاید کوچک باشد ولی برای استفاده در انواع نیاز ها آماده است.

source: Configuration and Conventions
fa: پیکربندی و قراردادها

source: Flask has many configuration values, with sensible defaults, and a few conventions when getting started. By convention, templates and static files are stored in subdirectories within the application's Python source tree, with the names :file:`templates` and :file:`static` respectively. While this can be changed, you usually don't have to, especially when getting started.
fa: فلاسک دارای مقادیر زیادی از پیکربندی با پیش فرض های معقول، و چند قرارداد در هنگام شروع است. طبق قرارداد، قالب‌ها و فایل‌های استاتیک در زیرشاخه‌های منبع برنامه، با نام‌ های :file:`templates` و :file:`static` ذخیره می‌شوند. البته میتوان آنها را تغییر داد ولی معمولا به خصوص در هنگام شروع مجبور نیستید که آنها را تغییر دهید.

source: Growing with Flask
fa: رشد با فلاسک

source: Once you have Flask up and running, you'll find a variety of extensions available in the community to integrate your project for production.
fa: هنگامی که فلاسک را راه‌اندازی و اجرا کردید، انواع افزونه‌های موجود در جامعه را برای ادغام در پروژه خود پیدا خواهید کرد.

source: As your codebase grows, you are free to make the design decisions appropriate for your project. Flask will continue to provide a very simple glue layer to the best that Python has to offer. You can implement advanced patterns in SQLAlchemy or another database tool, introduce non-relational data persistence as appropriate, and take advantage of framework-agnostic tools built for WSGI, the Python web interface.
fa: همانطور که پایهء کد شما رشد میکند، شما آزاد هستید که تصمیمات مناسب برای طراحی پروژه خود را بگیرید. فلاسک به ارائه یک لایه ساده برای بهترین چیزی که پایتون ارائه میدهد، ادامه خواهد داد. شما میتوانید الگو های پیشرفته را در SQLAlchemy یا هر ابزار پایگاه داده دیگری پیاده سازی کنید، ماندگاری داده های غیر رابطه ای را به عنوان مناسب معرفی کنید و از ابزار های framework-agnostic ساخته شده برای WSGI در رابط وب پایتون استفاده کنید.
