Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/index.po
Languages: fa

source: Welcome to Flask
fa: به فلاسک خوش آمدید

source: Welcome to Flask's documentation. Get started with :doc:`installation` and then get an overview with the :doc:`quickstart`. There is also a more detailed :doc:`tutorial/index` that shows how to create a small but complete application with Flask. Common patterns are described in the :doc:`patterns/index` section. The rest of the docs describe each component of Flask in detail, with a full reference in the :doc:`api` section.
fa: به مستندات فلاسک خوش آمدید. از :doc:`installation` شروع کنید و سپس یک نمای کلی با :doc:`quickstart` دریافت کنید. همچنین بخش :doc:`tutorial/index` با جزئیات بیشتری، نحوه ایجاد یک برنامه کوچک ولی کامل را با فلاسک نشان می‌دهد. الگو های رایح نیز در :doc:`patterns/index` توضیح داده شده است. بخش :doc:`api` نیز ارجاع کاملی برای روابط است و بقیه اسناد نیز هر یک از اجزای فلاسک را به تفصیل شرح می دهند.

source: Flask depends on the `Jinja`_ template engine and the `Werkzeug`_ WSGI toolkit. The documentation for these libraries can be found at:
fa: فلاسک از `Jinja`_ برای موتور قالب‌ها و `Werkzeug`_ برای ابزار WSGI استفاده می‌کند. مستندات هرکدام از این کتابخانه‌ها را میتوانید در اینجا ببنید:

source: `Jinja documentation <https://jinja.palletsprojects.com/>`_
fa: `مستندات jinja <https://jinja.palletsprojects.com/>`_

source: `Werkzeug documentation <https://werkzeug.palletsprojects.com/>`_
fa: `مستدات Werkzeug <https://werkzeug.palletsprojects.com/>`_

source: User's Guide
fa: راهنمای کاربر

source: This part of the documentation, which is mostly prose, begins with some background information about Flask, then focuses on step-by-step instructions for web development with Flask.
fa: این قسمت از مستندات بیشتر متن هستند و با برخی از اطلاعات پس‌زمینه ای فلاسک شروع می‌شود. سپس بر روی دستور عمل های گام به گام توسعه وب با فلاسک تمرکز می‌کند.

source: API Reference
fa: مرجع API

source: If you are looking for information on a specific function, class or method, this part of the documentation is for you.
fa: اگر به دنبال اطلاعاتی در مورد یک تابع، کلاس یا روش خاص هستید، این بخش از مستندات مناسب شماست.

source: Additional Notes
fa: یادداشت های اضافی

source: Design notes, legal information and changelog are here for the interested.
fa: یادداشت های طراحی، اطلاعات حقوقی و تغییرات در اینجا برای علاقمندان است.
