Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/installation.po
Languages: fa

source: Installation
fa: نصب و راه اندازی

source: Python Version
fa: نسخه پایتون

source: Dependencies
fa: وابستگی ها

source: These distributions will be installed automatically when installing Flask.
fa: این توزیع ها به صورت خودکار هنگام نصب فلاسک، نصب می‌شوند.

source: `Werkzeug`_ implements WSGI, the standard Python interface between applications and servers.
fa: `Werkzeug`_ . رابط استاندارد پایتون بین برنامه‌ها و سرورها را پیاده‌سازی می‌کند.

source: `Jinja`_ is a template language that renders the pages your application serves.
fa: `Jinja`_ یک زبان برای قالب است که صفحاتی را که برنامه شما ارائه می‌دهد(render)، را استفاده می‌کند.

source: `MarkupSafe`_ comes with Jinja. It escapes untrusted input when rendering templates to avoid injection attacks.
fa: `MarkupSafe`_ همراه Jinja نصب می‌شود. MarkupSafe هنگام ارائه قالب ها برای جلوگیری از حملات XSS، از ورودی نامعتبرجلوگیری میکند.

source: `ItsDangerous`_ securely signs data to ensure its integrity. This is used to protect Flask's session cookie.
fa: `ItsDangerous`_ داده ها را به صورت ایمن امضا می کند تا از یکپارچگی آن اطمینان حاصل کند. این برای محافظت از کوکی جلسه فلاسک استفاده می شود.

source: `Click`_ is a framework for writing command line applications. It provides the ``flask`` command and allows adding custom management commands.
fa: `Click`_ چارچوبی برای نوشتن برنامه های خط فرمان است. این دستور «flask» را ارائه می دهد و اجازه می دهد تا دستورات مدیریت سفارشی را اضافه کنید.

source: `Blinker`_ provides support for :doc:`signals`.
fa: `Blinker`_ از :doc:`signals` پشتیبانی می کند.

source: Optional dependencies
fa: وابستگی های اختیاری

source: These distributions will not be installed automatically. Flask will detect and use them if you install them.
fa: این توزیع ها به صورت خودکار نصب نمی شوند. در صورت نصب فلاسک آنها را شناسایی و استفاده می کند.

source: `python-dotenv`_ enables support for :ref:`dotenv` when running ``flask`` commands.
fa: `python-dotenv`_ پشتیبانی از :ref:`dotenv` را هنگام اجرای دستورات ``flask`` فعال می کند.

source: `Watchdog`_ provides a faster, more efficient reloader for the development server.
fa: `Watchdog`_ یک بارگیری مجدد سریعتر و کارآمدتر برای سرور توسعه ارائه می دهد.

source: You may choose to use gevent or eventlet with your application. In this case, greenlet>=1.0 is required. When using PyPy, PyPy>=7.3.7 is required.
fa: می توانید انتخاب کنید که از gevent یا eventlet برای برنامه خود استفاده کنید. در این مورد، greenlet>=1.0 مورد نیاز است. هنگام استفاده از این PyPy>=7.3.7 نیاز است.

source: These are not minimum supported versions, they only indicate the first versions that added necessary features. You should use the latest versions of each.
fa: اینها حداقل نسخه های پشتیبانی شده نیستند، آنها فقط اولین نسخه هایی را نشان می دهند که ویژگی های لازم را اضافه کرده اند. شما باید از آخرین نسخه های هر کدام استفاده کنید.

source: Virtual environments
fa: محیط های مجازی

source: Use a virtual environment to manage the dependencies for your project, both in development and in production.
fa: از یک محیط مجازی برای مدیریت وابستگی های پروژه خود چه در توسعه و چه در تولید استفاده کنید.

source: What problem does a virtual environment solve? The more Python projects you have, the more likely it is that you need to work with different versions of Python libraries, or even Python itself. Newer versions of libraries for one project can break compatibility in another project.
fa: محیط مجازی چه مشکلی را حل می کند؟ هر چه تعداد پروژه های پایتون بیشتر باشد، احتمال اینکه نیاز باشد با نسخه های مختلف کتابخانه های پایتون یا حتی خود پایتون کار کنید، بیشتر می شود. نسخه های جدیدتر کتابخانه ها برای یک پروژه می توانند سازگاری در پروژه دیگر را از بین ببرند.

source: Virtual environments are independent groups of Python libraries, one for each project. Packages installed for one project will not affect other projects or the operating system's packages.
fa: محیط های مجازی گروه های مستقلی از کتابخانه های پایتون هستند که برای هر پروژه یکی هستند. بسته های نصب شده برای یک پروژه روی پروژه های دیگر یا بسته های سیستم عامل تأثیری نخواهد داشت.

source: Python comes bundled with the :mod:`venv` module to create virtual environments.
fa: پایتون همراه با ماژول :mod:`venv` برای ایجاد محیط های مجازی ارائه می شود.

source: Create an environment
fa: ساخت یک محیط

source: macOS/Linux
fa: مک/لینوکس

source: Windows
fa: ویندوز

source: Activate the environment
fa: فعال سازی یک محیط

source: Before you work on your project, activate the corresponding environment:
fa: قبل از اینکه روی پروژه خود کار کنید، محیط مربوطه را فعال کنید:

source: Your shell prompt will change to show the name of the activated environment.
fa: پس از فعال سازی، پوسته شما نام محیط فعال را نشان می‌دهد.

source: Install Flask
fa: نصب فلاسک

source: Within the activated environment, use the following command to install Flask:
fa: در محیط فعال شده، از دستور زیر برای نصب فلاسک استفاده کنید:

source: Flask is now installed. Check out the :doc:`/quickstart` or go to the :doc:`Documentation Overview </index>`.
fa: فلاسک اکنون نصب شده است. :doc:`/quickstart` را بررسی کنید یا به :doc:`بررسی کلی مستند </index>` بروید.
