Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/logging.po
Languages: fa

source: Logging
fa: لاگ کردن

source: Flask uses standard Python :mod:`logging`. Messages about your Flask application are logged with :meth:`app.logger <flask.Flask.logger>`, which takes the same name as :attr:`app.name <flask.Flask.name>`. This logger can also be used to log your own messages.
fa: فلاسک از :mod:`logging` در پایتون استاندارد استفاده می کند. پیام‌های مربوط به برنامه فلاسک شما با :meth:`app.logger <flask.Flask.logger>` ثبت می‌شوند که نامی مشابه :attr:`app.name <flask.Flask.name>` دارد. این لاگر همچنین می تواند برای ثبت پیام های خود استفاده شود.

source: If you don't configure logging, Python's default log level is usually 'warning'. Nothing below the configured level will be visible.
fa: اگر لاگ را پیکربندی نکنید، سطح گزارش پیش‌فرض پایتون معمولاً «هشدار» است. هیچ چیزی کمتر از سطح پیکربندی شده قابل مشاهده نخواهد بود.

source: Basic Configuration
fa: پیکربندی پایه

source: When you want to configure logging for your project, you should do it as soon as possible when the program starts. If :meth:`app.logger <flask.Flask.logger>` is accessed before logging is configured, it will add a default handler. If possible, configure logging before creating the application object.
fa: هنگامی که می خواهید لاگ کردن پروژه خود را پیکربندی کنید، باید در اسرع وقت زمانی که برنامه شروع می شود این کار را انجام دهید. اگر قبل از پیکربندی ورود به سیستم به :meth:`app.logger <flask.Flask.logger>` دسترسی داشته باشید، یک کنترل کننده پیش فرض اضافه می کند. در صورت امکان، قبل از ایجاد شی برنامه، ورود به سیستم را پیکربندی کنید.

source: This example uses :func:`~logging.config.dictConfig` to create a logging configuration similar to Flask's default, except for all logs::
fa: این مثال از :func:`~logging.config.dictConfig` برای ایجاد یک پیکربندی گزارشگیری مشابه با پیش‌فرض فلاسک استفاده می‌کند، البته به جز همه گزارش‌ها::

source: Default Configuration
fa: پیکربندی پیش فرض

source: If you do not configure logging yourself, Flask will add a :class:`~logging.StreamHandler` to :meth:`app.logger <flask.Flask.logger>` automatically. During requests, it will write to the stream specified by the WSGI server in ``environ['wsgi.errors']`` (which is usually :data:`sys.stderr`). Outside a request, it will log to :data:`sys.stderr`.
fa: اگر خودتان لاگ را پیکربندی نکنید، فلاسک یک :class:`~logging.StreamHandler` را به صورت خودکار به :meth:`app.logger <flask.Flask.logger>` اضافه می کند. در طول درخواست‌ها، به جریانی که سرور WSGI در ``environ['wsgi.errors']`` (که معمولاً :data:`sys.stderr` است) می‌نویسد. خارج از یک درخواست، به :data:`sys.stderr` وارد می شود.

source: Removing the Default Handler
fa: حذف کنترل کننده پیش فرض

source: If you configured logging after accessing :meth:`app.logger <flask.Flask.logger>`, and need to remove the default handler, you can import and remove it::
fa: اگر پس از دسترسی به :meth:`app.logger <flask.Flask.logger>` ورود به سیستم را پیکربندی کرده اید و باید کنترل کننده پیش فرض را حذف کنید، می توانید آن را وارد و حذف کنید::

source: Email Errors to Admins
fa: ایمیل زدن ارور به مدیران

source: When running the application on a remote server for production, you probably won't be looking at the log messages very often. The WSGI server will probably send log messages to a file, and you'll only check that file if a user tells you something went wrong.
fa: هنگام اجرای برنامه بر روی یک سرور راه دور برای تولید، احتمالاً اغلب به پیام های گزارش نگاه نمی کنید. سرور WSGI احتمالاً پیام‌های گزارش را به یک فایل ارسال می‌کند و شما فقط در صورتی آن فایل را بررسی می‌کنید که کاربر به شما بگوید مشکلی پیش آمده است.

source: To be proactive about discovering and fixing bugs, you can configure a :class:`logging.handlers.SMTPHandler` to send an email when errors and higher are logged. ::
fa: برای فعال بودن در مورد کشف و رفع اشکالات، می توانید یک :class:`logging.handlers.SMTPHandler` را پیکربندی کنید تا در صورت ثبت خطاها و بالاتر، ایمیل ارسال کند. ::

source: This requires that you have an SMTP server set up on the same server. See the Python docs for more information about configuring the handler.
fa: این مستلزم آن است که یک سرور SMTP روی همان سرور راه اندازی کنید. برای اطلاعات بیشتر در مورد پیکربندی هندلر به اسناد پایتون مراجعه کنید.

source: Injecting Request Information
fa: تزریق اطلاعات درخواستی

source: Seeing more information about the request, such as the IP address, may help debugging some errors. You can subclass :class:`logging.Formatter` to inject your own fields that can be used in messages. You can change the formatter for Flask's default handler, the mail handler defined above, or any other handler. ::
fa: دیدن اطلاعات بیشتر در مورد درخواست، مانند آدرس IP، ممکن است به رفع اشکال برخی از خطاها کمک کند. می‌توانید برای تزریق فیلدهای خود که می‌توانند در پیام‌ها استفاده شوند، :class:`logging.Formatter` را زیرکلاس کنید. می‌توانید فرمت‌کننده کنترل‌کننده پیش‌فرض Flask، کنترل‌کننده نامه تعریف‌شده در بالا، یا هر کنترل‌کننده دیگری را تغییر دهید. ::

source: Other Libraries
fa: سایر کتابخانه ها

source: Other libraries may use logging extensively, and you want to see relevant messages from those logs too. The simplest way to do this is to add handlers to the root logger instead of only the app logger. ::
fa: کتابخانه‌های دیگر ممکن است به طور گسترده از ثبت استفاده کنند، و شما می‌خواهید پیام‌های مرتبط را نیز از آن گزارش‌ها ببینید. ساده ترین راه برای انجام این کار اضافه کردن کنترلرها به روت لاگر به جای اپ لاگر است. ::

source: Depending on your project, it may be more useful to configure each logger you care about separately, instead of configuring only the root logger. ::
fa: بسته به پروژه شما، ممکن است به جای پیکربندی فقط روت لاگر، پیکربندی هر لاگر مورد نظرتان به طور جداگانه مفید باشد. ::

source: Werkzeug
fa: کتابخانه Werkzeug

source: Werkzeug logs basic request/response information to the ``'werkzeug'`` logger. If the root logger has no handlers configured, Werkzeug adds a :class:`~logging.StreamHandler` to its logger.
fa: Werkzeug اطلاعات اولیه درخواست/پاسخ را به ثبت‌کننده ``'werkzeug'`` ثبت می‌کند. اگر root logger پیکربندی نشده باشد، Werkzeug یک :class:`~logging.StreamHandler` را به لاگر خود اضافه می کند.

source: Flask Extensions
fa: افزونه های فلسک

source: Depending on the situation, an extension may choose to log to :meth:`app.logger <flask.Flask.logger>` or its own named logger. Consult each extension's documentation for details.
fa: بسته به موقعیت، یک برنامه افزودنی ممکن است ورود به :meth:`app.logger <flask.Flask.logger>` یا ثبت نام خود را انتخاب کند. برای جزئیات، با اسناد هر افزونه مشورت کنید.
