Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/quickstart.po
Languages: fa

source: Wrapping ``app.wsgi_app`` instead of ``app`` means that ``app`` still points at your Flask application, not at the middleware, so you can continue to use and configure ``app`` directly.
fa: قرار دادن ``app.wsgi_app`` به جای ``app`` به این معنی است که ``app`` همچنان به برنامه فلاسک شما اشاره می‌کند، نه به میان‌افزار، بنابراین می‌توانید مستقیماً به استفاده و پیکربندی ``app`` ادامه دهید.

source: Using Flask Extensions
fa: استفاده از افزونه های فلاسک

source: Extensions are packages that help you accomplish common tasks. For example, Flask-SQLAlchemy provides SQLAlchemy support that makes it simple and easy to use with Flask.
fa: افزونه ها پکیج هایی هستند که کمک میکنند تا تکالیف مشترکی را انجام دهند. برای مثال Flask-SQLAlchemy پشتیبانی از SQLAlchemy راه تهیه میکند و کار با آن در فلاسک را آسانتر میسازد.

source: For more on Flask extensions, see :doc:`extensions`.
fa: برای افزونه های بیشتر فلاسک :doc:`extensions` را ببنید.

source: Deploying to a Web Server
fa: استقرار کردن به یک وب سرور

source: Ready to deploy your new Flask app? See :doc:`deploying/index`.
fa: آیا برای استقرار برنامه فلاسک جدیدتان آماده اید؟ :doc:`deploying/index` با ببنید.
