Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/quickstart.po
Languages: fa

source: Unsure what that :class:`~flask.g` object is? It's something in which you can store information for your own needs. See the documentation for :class:`flask.g` and :doc:`patterns/sqlite3`.
fa: اطمینان ندارید که شی :class:`~flask.g` چیست؟ این چیزی است که در آن می توانید اطلاعات را برای نیازهای خود ذخیره کنید. برای اطلاعات بیشتر به مستندات :class:`flask.g` و :doc:`patterns/sqlite3` مراجعه کنید.

source: Accessing Request Data
fa: دسترسی به داده های درخواستی

source: For web applications it's crucial to react to the data a client sends to the server. In Flask this information is provided by the global :class:`~flask.request` object. If you have some experience with Python you might be wondering how that object can be global and how Flask manages to still be threadsafe. The answer is context locals:
fa: برای برنامه های کاربردی وب، بسیار مهم است که به داده هایی که مشتری به سرور ارسال می کند واکنش نشان دهد. در فلاسک این اطلاعات توسط شیء سراسری :class:`~flask.request` ارائه می شود. اگر تجربه‌ای با پایتون دارید، ممکن است تعجب کنید که چگونه آن شی می‌تواند سراسری باشد و چگونه فلاسک می‌تواند همچنان امن باشد. پاسخ متن محلی است:

source: Context Locals
fa: متن محلی

source: Insider Information
fa: اطلاعات داخلی

source: If you want to understand how that works and how you can implement tests with context locals, read this section, otherwise just skip it.
fa: اگر می‌خواهید بدانید که چگونه کار می‌کند و چگونه می‌توانید آزمایش‌ها را با متن محلی پیاده‌سازی کنید، این بخش را بخوانید، در غیر این صورت فقط آن را نادیده بگیرید.

source: Certain objects in Flask are global objects, but not of the usual kind. These objects are actually proxies to objects that are local to a specific context. What a mouthful. But that is actually quite easy to understand.
fa: برخی از اشیاء در فلاسک، اشیاء جهانی هستند، اما از نوع معمول نیستند. این اشیاء پروکسی برای اشیایی هستند که محلی برای یک زمینه خاص هستند. اما درک آن بسیار آسان است.

source: Imagine the context being the handling thread. A request comes in and the web server decides to spawn a new thread (or something else, the underlying object is capable of dealing with concurrency systems other than threads). When Flask starts its internal request handling it figures out that the current thread is the active context and binds the current application and the WSGI environments to that context (thread). It does that in an intelligent way so that one application can invoke another application without breaking.
fa: تصور کنید که زمینه، موضوع مدیریت است. یک درخواست وارد می‌شود و وب‌سرور تصمیم می‌گیرد یک رشته جدید ایجاد کند (یا چیز دیگری، شی زیربنایی قادر است با سیستم‌ های همزمانی غیر از رشته‌ها سروکار داشته باشد). هنگامی که فلاسک رسیدگی به درخواست داخلی خود را شروع می کند، متوجه می شود که رشته فعلی زمینه فعال است و برنامه فعلی و محیط های WSGI را به آن زمینه (رشته) متصل می کند. این کار را به روشی هوشمند انجام می دهد تا یک برنامه بتواند برنامه دیگری را بدون شکستن فراخوانی کند.

source: So what does this mean to you? Basically you can completely ignore that this is the case unless you are doing something like unit testing. You will notice that code which depends on a request object will suddenly break because there is no request object. The solution is creating a request object yourself and binding it to the context. The easiest solution for unit testing is to use the :meth:`~flask.Flask.test_request_context` context manager. In combination with the ``with`` statement it will bind a test request so that you can interact with it. Here is an example::
fa: پس این برای شما چه معنی دارد؟ اساساً می توانید کاملاً نادیده بگیرید که این مورد است مگر اینکه در حال انجام کاری مانند تست واحد باشید. متوجه خواهید شد که کدی که به یک شی درخواست بستگی دارد ناگهان شکسته می شود زیرا شی درخواستی وجود ندارد. راه حل این است که خودتان یک شی درخواست ایجاد کنید و آن را به متن متصل کنید. ساده ترین راه حل برای تست واحد استفاده از مدیر زمینه :meth:`~flask.Flask.test_request_context` است. در ترکیب با عبارت ``with`` یک درخواست آزمایشی را متصل می کند تا بتوانید با آن تعامل داشته باشید. به عنوان مثال::

source: The other possibility is passing a whole WSGI environment to the :meth:`~flask.Flask.request_context` method::
fa: امکان دیگر ارسال یک محیط WSGI کامل به متد :meth:`~flask.Flask.request_context` method::

source: The Request Object
fa: شی درخواست

source: The request object is documented in the API section and we will not cover it here in detail (see :class:`~flask.Request`). Here is a broad overview of some of the most common operations. First of all you have to import it from the ``flask`` module::
fa: شی درخواست در بخش API مستند شده است و ما در اینجا آن را با جزئیات پوشش نمی دهیم (به :class:`~flask.Request` مراجعه کنید). در اینجا یک مرور کلی از برخی از رایج ترین عملیات ارائه شده است. اول از همه، شما باید آن را از ماژول ``flask`` وارد کنید::

source: The current request method is available by using the :attr:`~flask.Request.method` attribute. To access form data (data transmitted in a ``POST`` or ``PUT`` request) you can use the :attr:`~flask.Request.form` attribute. Here is a full example of the two attributes mentioned above::
fa: روش درخواست فعلی با استفاده از ویژگی :attr:`~flask.Request.method` در دسترس است. برای دسترسی به داده‌های فرم (داده‌های ارسال شده در درخواست ``POST`` یا ``PUT``) می‌توانید از ویژگی :attr:`~flask.Request.form` استفاده کنید. در اینجا یک مثال کامل از دو ویژگی ذکر شده در بالا آورده شده است::

source: What happens if the key does not exist in the ``form`` attribute? In that case a special :exc:`KeyError` is raised. You can catch it like a standard :exc:`KeyError` but if you don't do that, a HTTP 400 Bad Request error page is shown instead. So for many situations you don't have to deal with that problem.
fa: اگر کلید در ویژگی ``form`` وجود نداشته باشد چه اتفاقی می افتد؟ در آن صورت، یک :exc:`KeyError` ویژه ایجاد می شود. می‌توانید آن را مانند یک :exc:`KeyError` استاندارد دریافت کنید، اما اگر این کار را نکنید، یک صفحه خطای درخواست بد HTTP 400 نشان داده می‌شود. بنابراین برای بسیاری از موقعیت ها، لازم نیست با آن مشکل کنار بیایید.

source: To access parameters submitted in the URL (``?key=value``) you can use the :attr:`~flask.Request.args` attribute::
fa: برای دسترسی به پارامترهای ارسال شده در URL (``?key=value``) می توانید از ویژگی :attr:`~flask.Request.args` استفاده کنید::

source: We recommend accessing URL parameters with `get` or by catching the :exc:`KeyError` because users might change the URL and presenting them a 400 bad request page in that case is not user friendly.
fa: توصیه می‌کنیم با `get` یا با :exc:`KeyError` به پارامترهای URL دسترسی پیدا کنید، زیرا کاربر ممکن است URL را تغییر دهند و در این صورت یک صفحه درخواست 400 بد برای آن‌ها ارائه می دهد که کاربر پسند نیست.

source: For a full list of methods and attributes of the request object, head over to the :class:`~flask.Request` documentation.
fa: برای فهرست کاملی از متدها و ویژگی های شی درخواست، مستندات :class:`~flask.Request` را بررسی کنید.

source: File Uploads
fa: آپلود فایل

source: You can handle uploaded files with Flask easily. Just make sure not to forget to set the ``enctype="multipart/form-data"`` attribute on your HTML form, otherwise the browser will not transmit your files at all.
fa: شما میتوانید به آسانی فایل هایتان را با فلاسک هندل کنید. فقط نباید فراموش کنید که ``enctype="multipart/form-data"`` را در فرم HTML خودتان قرار دهید مرورگر شما بدون این فایلی را انتقال نخواهد داد.

source: Uploaded files are stored in memory or at a temporary location on the filesystem. You can access those files by looking at the :attr:`~flask.request.files` attribute on the request object. Each uploaded file is stored in that dictionary. It behaves just like a standard Python :class:`file` object, but it also has a :meth:`~werkzeug.datastructures.FileStorage.save` method that allows you to store that file on the filesystem of the server. Here is a simple example showing how that works::
fa: فایل های آپلود شده در حافظه یا یک مکان موقت در فایل سیستم ها ذخیره می‌شوند. شما میتوانید با نگاه کردن به شی :attr:`~flask.request.files` دسترسی مناسب برای این درخواست را بدهید. هر فایل آپلود شده در دایرکتوری ای ذخیره می‌شود. این مانند شی استاندارد :class:`file` رفتار می‌کند ولی شیوه :meth:`~werkzeug.datastructures.FileStorage.save` همیشه مجاز می‌کند تا شما این فایل را در فایل سیستم ها ذخیره کنید::

source: If you want to know how the file was named on the client before it was uploaded to your application, you can access the :attr:`~werkzeug.datastructures.FileStorage.filename` attribute. However please keep in mind that this value can be forged so never ever trust that value. If you want to use the filename of the client to store the file on the server, pass it through the :func:`~werkzeug.utils.secure_filename` function that Werkzeug provides for you::
fa: اگر شما میخواهید بدانید که چگونه فایل ها قبل از آپلود در کلاینت برنامه شما نام گزاری می‌شوند شیوه :attr:`~werkzeug.datastructures.FileStorage.filename` را بررسی کنید. با این حال لطفاً به خاطر داشته باشید که این شیوه قابل جعل است، بنابراین هرگز به آن ارزش اعتماد نکنید. اگر می خواهید از نام فایل کلاینت برای ذخیره فایل در سرور استفاده کنید، آن را از طریق تابع :func:`~werkzeug.utils.secure_filename` که Werkzeug برای شما ارائه می کند، ارسال کنید::

source: For some better examples, see :doc:`patterns/fileuploads`.
fa: برای مثال های بهتر :doc:`patterns/fileuploads` را ببینید.

source: Cookies
fa: کوکی ها(Cookies)

source: To access cookies you can use the :attr:`~flask.Request.cookies` attribute. To set cookies you can use the :attr:`~flask.Response.set_cookie` method of response objects. The :attr:`~flask.Request.cookies` attribute of request objects is a dictionary with all the cookies the client transmits. If you want to use sessions, do not use the cookies directly but instead use the :ref:`sessions` in Flask that add some security on top of cookies for you.
fa: برای دسترسی به کوکی ها می توانید از ویژگی :attr:`~flask.Request.cookies` استفاده کنید. برای تنظیم کوکی ها می توانید از روش :attr:`~flask.Response.set_cookie` برای اشیاء پاسخ استفاده کنید. ویژگی :attr:`~flask.Request.cookies` از اشیاء درخواست، یک فرهنگ لغت با تمام کوکی هایی است که مشتری ارسال می کند. اگر می‌خواهید از جلسات استفاده کنید، مستقیماً از کوکی‌ها استفاده نکنید، بلکه از :ref:`sessions` در Flask استفاده کنید که امنیت را در بالای کوکی‌ها برای شما اضافه می‌کند.

source: Reading cookies::
fa: خواندن کوکی ها::

source: Storing cookies::
fa: ذخیره کوکی ها::

source: Note that cookies are set on response objects. Since you normally just return strings from the view functions Flask will convert them into response objects for you. If you explicitly want to do that you can use the :meth:`~flask.make_response` function and then modify it.
fa: توجه داشته باشید که کوکی ها روی اشیاء پاسخ(response objects) تنظیم می شوند. از آنجایی که شما معمولاً فقط رشته ها را از توابع view برمی گردانید، Flask آنها را به اشیاء پاسخ برای شما تبدیل می کند. اگر صراحتاً می خواهید این کار را انجام دهید، می توانید از تابع :meth:`~flask.make_response` استفاده کنید و سپس آن را تغییر دهید.

source: Sometimes you might want to set a cookie at a point where the response object does not exist yet. This is possible by utilizing the :doc:`patterns/deferredcallbacks` pattern.
fa: گاهی اوقات ممکن است بخواهید یک کوکی را در نقطه ای تنظیم کنید که شی پاسخ هنوز وجود ندارد. این کار با استفاده از الگوی :doc:`patterns/deferredcallbacks` امکان پذیر است.

source: For this also see :ref:`about-responses`.
fa: برای این نیز به :ref:`about-responses` مراجعه کنید.

source: Redirects and Errors
fa: تغییر مسیرها و خطاها(Redirects and Errors)

source: To redirect a user to another endpoint, use the :func:`~flask.redirect` function; to abort a request early with an error code, use the :func:`~flask.abort` function::
fa: برای تغییر مسیر کاربر به نقطه پایانی دیگر، از تابع :func:`~flask.redirect` استفاده کنید. برای لغو زودهنگام درخواست با کد خطا، از تابع :func:`~flask.abort` استفاده کنید::

source: This is a rather pointless example because a user will be redirected from the index to a page they cannot access (401 means access denied) but it shows how that works.
fa: این یک مثال نسبتاً بی‌معنی است زیرا کاربر از فهرست به صفحه‌ای هدایت می‌شود که نمی‌تواند به آن دسترسی داشته باشد (۴۰۱ به معنای دسترسی ممنوع است) اما نشان می‌دهد که چگونه کار می‌کند.

source: By default a black and white error page is shown for each error code. If you want to customize the error page, you can use the :meth:`~flask.Flask.errorhandler` decorator::
fa: به طور پیش فرض یک صفحه خطای سیاه و سفید برای هر کد خطا نشان داده می شود. اگر می‌خواهید صفحه خطا را سفارشی کنید، می‌توانید از دکوراتور :meth:`~flask.Flask.errorhandler` استفاده کنید::

source: Note the ``404`` after the :func:`~flask.render_template` call. This tells Flask that the status code of that page should be 404 which means not found. By default 200 is assumed which translates to: all went well.
fa: بعد از فراخوانی :func:`~flask.render_template` به «۴۰۴» توجه کنید. این به فلاسک می گوید که کد وضعیت آن صفحه باید ۴۰۴ باشد که به معنای یافت نشد. به طور پیش فرض «۲۰۰» در نظر گرفته شده است که به این معنی است: همه چیز خوب پیش رفت.

source: See :doc:`errorhandling` for more details.
fa: برای جزئیات بیشتر به :doc:`errorhandling` مراجعه کنید.

source: About Responses
fa: درباره پاسخ ها

source: The return value from a view function is automatically converted into a response object for you. If the return value is a string it's converted into a response object with the string as response body, a ``200 OK`` status code and a :mimetype:`text/html` mimetype. If the return value is a dict, :func:`jsonify` is called to produce a response. The logic that Flask applies to converting return values into response objects is as follows:
fa: مقدار بازگشتی از یک تابع view به طور خودکار به یک شی پاسخ برای شما تبدیل می شود. اگر مقدار بازگشتی یک رشته باشد، به یک شی پاسخ با رشته به عنوان بدنه پاسخ، یک کد وضعیت «۲۰۰ OK» و یک :mimetype:`text/html` تبدیل می شود. اگر مقدار بازگشتی یک dict باشد، :func:`jsonify` برای ایجاد پاسخ فراخوانی می شود. منطقی که فلاسک برای تبدیل مقادیر برگشتی به اشیاء پاسخ اعمال می کند به شرح زیر است:

source: If a response object of the correct type is returned it's directly returned from the view.
fa: اگر یک شی پاسخ از نوع صحیح برگردانده شود، مستقیماً از نمای بازگردانده می شود.

source: If it's a string, a response object is created with that data and the default parameters.
fa: اگر یک رشته باشد، یک شی پاسخ با آن داده و پارامترهای پیش فرض ایجاد می شود.

source: If it's a dict, a response object is created using ``jsonify``.
fa: اگر یک دستور باشد، یک شی پاسخ با استفاده از ``jsonify`` ایجاد می شود.

source: If a tuple is returned the items in the tuple can provide extra information. Such tuples have to be in the form ``(response, status)``, ``(response, headers)``, or ``(response, status, headers)``. The ``status`` value will override the status code and ``headers`` can be a list or dictionary of additional header values.
fa: اگر یک tuple برگردانده شود، آیتم های تاپل می توانند اطلاعات بیشتری را ارائه دهند. این تاپل ها باید به شکل ``(response, status)``،``(response, headers)`` یا ``(response, status, headers)`` باشند. مقدار ``status`` کد وضعیت را لغو می کند و ``headers`` می تواند فهرست یا فرهنگ لغت مقادیر اضافی سرصفحه باشد.

source: If none of that works, Flask will assume the return value is a valid WSGI application and convert that into a response object.
fa: اگر هیچ کدام از این موارد کار نکرد، فلاسک مقدار بازگشتی را یک برنامه معتبر WSGI فرض می‌کند و آن را به یک شی پاسخ تبدیل می‌کند.

source: If you want to get hold of the resulting response object inside the view you can use the :func:`~flask.make_response` function.
fa: اگر می خواهید شی پاسخ به دست آمده را در داخل view نگه دارید، می توانید از تابع :func:`~flask.make_response` استفاده کنید.

source: Imagine you have a view like this::
fa: تصور کنید نماای مثل این دارید::

source: You just need to wrap the return expression with :func:`~flask.make_response` and get the response object to modify it, then return it::
fa: شما فقط باید عبارت return را با :func:`~flask.make_response` بگزارید و شی پاسخ را دریافت کنید تا آن را تغییر دهید، سپس آن را برگردانید::

source: APIs with JSON
fa: ای پی آی با جیسان(APIs with JSON)

source: A common response format when writing an API is JSON. It's easy to get started writing such an API with Flask. If you return a ``dict`` from a view, it will be converted to a JSON response.
fa: فرمت پاسخ متداول هنگام نوشتن یک API، جیسان(JSON) است. شروع نوشتن چنین جیسان با فلاسک آسان است. اگر یک ``dict`` را از یک نمای برگردانید، به یک پاسخ JSON تبدیل می‌شود.

source: Depending on your API design, you may want to create JSON responses for types other than ``dict``. In that case, use the :func:`~flask.json.jsonify` function, which will serialize any supported JSON data type. Or look into Flask community extensions that support more complex applications.
fa: بسته به طراحی API خود، ممکن است بخواهید پاسخ‌های JSON را برای انواعی غیر از ``dict`` ایجاد کنید. در آن صورت، از تابع :func:`~flask.json.jsonify` استفاده کنید، که هر نوع داده JSON پشتیبانی شده را سریال می کند. یا به برنامه های افزودنی انجمن فلاسک که از برنامه های پیچیده تری پشتیبانی می کنند نگاه کنید.

source: Sessions
fa: جلسات(Sessions)

source: In addition to the request object there is also a second object called :class:`~flask.session` which allows you to store information specific to a user from one request to the next. This is implemented on top of cookies for you and signs the cookies cryptographically. What this means is that the user could look at the contents of your cookie but not modify it, unless they know the secret key used for signing.
fa: علاوه بر شی درخواست، شی دومی به نام :class:`~flask.session` نیز وجود دارد که به شما امکان می دهد اطلاعات خاص یک کاربر را از یک درخواست به درخواست دیگر ذخیره کنید. این در بالای کوکی ها برای شما اجرا می شود و کوکی ها را به صورت رمزنگاری امضا می کند. این بدان معناست که کاربر می تواند به محتویات کوکی شما نگاه کند اما آن را تغییر ندهد، مگر اینکه کلید مخفی مورد استفاده برای امضا را بداند.

source: In order to use sessions you have to set a secret key. Here is how sessions work::
fa: برای استفاده از جلسات باید یک کلید مخفی تنظیم کنید. نحوه کار جلسات به شرح زیر است:

source: How to generate good secret keys
fa: چگونه کلید مخفی خوبی بسازیم

source: A secret key should be as random as possible. Your operating system has ways to generate pretty random data based on a cryptographic random generator. Use the following command to quickly generate a value for :attr:`Flask.secret_key` (or :data:`SECRET_KEY`)::
fa: یک کلید مخفی باید تا حد امکان تصادفی باشد. سیستم عامل شما راه هایی برای تولید داده های بسیار تصادفی بر اساس یک ژنراتور تصادفی رمزنگاری دارد. از دستور زیر برای ایجاد سریع مقدار برای :attr:`Flask.secret_key` (یا :data:`SECRET_KEY`)::

source: A note on cookie-based sessions: Flask will take the values you put into the session object and serialize them into a cookie. If you are finding some values do not persist across requests, cookies are indeed enabled, and you are not getting a clear error message, check the size of the cookie in your page responses compared to the size supported by web browsers.
fa: نکته ای در مورد جلسات مبتنی بر کوکی: فلاسک مقادیری را که در شی جلسه قرار داده اید می گیرد و آنها را به صورت سریالی در یک کوکی قرار می دهد. اگر متوجه شدید که برخی از مقادیر در بین درخواست‌ها باقی نمی‌مانند، کوکی‌ها در واقع فعال هستند و پیام خطای واضحی دریافت نمی‌کنید، اندازه کوکی را در پاسخ‌های صفحه خود در مقایسه با اندازه پشتیبانی شده توسط مرورگرهای وب بررسی کنید.

source: Besides the default client-side based sessions, if you want to handle sessions on the server-side instead, there are several Flask extensions that support this.
fa: علاوه بر جلسات پیش‌فرض مبتنی بر کلاینت، اگر می‌خواهید جلسات را در سمت سرور مدیریت کنید، چندین افزونه فلاسک وجود دارد که از این امر پشتیبانی می‌کنند.

source: Message Flashing
fa: فلش کردن پیام(Message Flashing)

source: Good applications and user interfaces are all about feedback. If the user does not get enough feedback they will probably end up hating the application. Flask provides a really simple way to give feedback to a user with the flashing system. The flashing system basically makes it possible to record a message at the end of a request and access it on the next (and only the next) request. This is usually combined with a layout template to expose the message.
fa: برنامه ها و رابط های کاربری خوب همه در مورد بازخورد هستند. اگر کاربر بازخورد کافی دریافت نکند، احتمالاً از برنامه متنفر خواهد شد. فلاسک یک راه بسیار ساده برای ارائه بازخورد به کاربر با سیستم فلش ارائه می دهد. سیستم فلش اساساً امکان ضبط یک پیام در انتهای درخواست و دسترسی به آن در درخواست بعدی (و فقط درخواست بعدی) را فراهم می کند. این معمولاً با یک الگوی طرح بندی ترکیب می شود تا پیام را آشکار کند.

source: To flash a message use the :func:`~flask.flash` method, to get hold of the messages you can use :func:`~flask.get_flashed_messages` which is also available in the templates. See :doc:`patterns/flashing` for a full example.
fa: برای فلش کردن یک پیام از روش :func:`~flask.flash` استفاده کنید، برای دریافت پیام ها می توانید از :func:`~flask.get_flashed_messages` استفاده کنید که در قالب ها نیز موجود است. برای مثال کامل به :doc:`patterns/flashing` مراجعه کنید.

source: Logging
fa: لاگ کردن(Logging)

source: Sometimes you might be in a situation where you deal with data that should be correct, but actually is not. For example you may have some client-side code that sends an HTTP request to the server but it's obviously malformed. This might be caused by a user tampering with the data, or the client code failing. Most of the time it's okay to reply with ``400 Bad Request`` in that situation, but sometimes that won't do and the code has to continue working.
fa: گاهی اوقات ممکن است در موقعیتی قرار بگیرید که با داده هایی برخورد می کنید که باید درست باشند، اما در واقع اینطور نیست. به عنوان مثال، ممکن است تعدادی کد سمت کلاینت داشته باشید که یک درخواست HTTP را به سرور ارسال می کند، اما به وضوح بدشکل است. این ممکن است به دلیل دستکاری کاربر در داده ها یا خرابی کد مشتری باشد. در بیشتر مواقع پاسخ دادن با ``400 Bad Request`` در آن موقعیت اشکالی ندارد، اما گاهی اوقات این کار انجام نمی‌شود و کد باید به کار خود ادامه دهد.

source: You may still want to log that something fishy happened. This is where loggers come in handy. As of Flask 0.3 a logger is preconfigured for you to use.
fa: ممکن است هنوز بخواهید ثبت کنید که یک اتفاق عجیب رخ داده است. اینجاست که لاگرها به کار می آیند. از Flask 0.3 یک لاگر از قبل برای استفاده شما پیکربندی شده است.

source: Here are some example log calls::
fa: در اینجا چند نمونه از لاگ ها آورده شده است:

source: The attached :attr:`~flask.Flask.logger` is a standard logging :class:`~logging.Logger`, so head over to the official :mod:`logging` docs for more information.
fa: :attr:`~flask.Flask.logger` پیوست شده یک گزارش استاندارد :class:`~logging.Logger` است، بنابراین برای اطلاعات بیشتر به اسناد رسمی :mod:`logging` بروید.

source: See :doc:`errorhandling`.
fa: به :doc:`errorhandling` مراجعه کنید.

source: Hooking in WSGI Middleware
fa: قلاب کردن در WSGI Middleware

source: To add WSGI middleware to your Flask application, wrap the application's ``wsgi_app`` attribute. For example, to apply Werkzeug's :class:`~werkzeug.middleware.proxy_fix.ProxyFix` middleware for running behind Nginx:
fa: برای افزودن میان‌افزار WSGI به برنامه Flask خود، ویژگی ``wsgi_app`` برنامه را بپیچید. برای مثال، برای اعمال میان‌افزار :class:`~werkzeug.middleware.proxy_fix.ProxyFix` برای اجرای پشت Nginx کد زیر را ببنید:
