Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/quickstart.po
Languages: fa

source: Quickstart
fa: شروع سریع

source: Eager to get started? This page gives a good introduction to Flask. Follow :doc:`installation` to set up a project and install Flask first.
fa: مشتاق شروع هستید؟ این صفحه اطلاعات خوبی درباره فلاسک می‌دهد. برای راه‌اندازی یک پروژه و نصب فلاسک، ابتدا :doc:`installation` را بررسی کنید.

source: A Minimal Application
fa: یک برنامه ساده

source: A minimal Flask application looks something like this:
fa: یک برنامه ساده فلاسک، چیزی شبیه به این است:

source: So what did that code do?
fa: این کد چه کاری می‌کند؟

source: First we imported the :class:`~flask.Flask` class. An instance of this class will be our WSGI application.
fa: ابتدا کلاس :class:`~flask.Flask` را وارد کردیم. یک نمونه کلاس در برنامه WSGI ما اینگونه خواهد بود.

source: Next we create an instance of this class. The first argument is the name of the application's module or package. ``__name__`` is a convenient shortcut for this that is appropriate for most cases. This is needed so that Flask knows where to look for resources such as templates and static files.
fa: بعد، یک نمونه از این کلاس ایجاد می کنیم. اولین آرگومان نام ماژول یا بسته برنامه است. ``__name__`` میانبر مناسبی برای این کار است و در اکثر موارد مناسب است. این آرگومان اجباری است چون باید فلاسک بداند که کجا به دنبال منابعی مانند قالب ها و فایل های استاتیک باشد.

source: We then use the :meth:`~flask.Flask.route` decorator to tell Flask what URL should trigger our function.
fa: سپس از دکوراتور :meth:`~flask.Flask.route` استفاده می کنیم تا به فلاسک بگوییم چه URL ی باید عملکرد ما را راه اندازی کند.

source: The function returns the message we want to display in the user's browser. The default content type is HTML, so HTML in the string will be rendered by the browser.
fa: تابع پیامی را که می خواهیم در مرورگر کاربر نمایش دهیم برمی گرداند. نوع محتوای پیش فرض HTML است، بنابراین کد HTML در رشته، توسط مرورگر ارائه می شود.

source: Save it as :file:`hello.py` or something similar. Make sure to not call your application :file:`flask.py` because this would conflict with Flask itself.
fa: آن را به صورت :file:`hello.py` یا هر چیز مشابه دیگر ذخیره کنید. مطمئن شوید که برنامه خود را :file:`flask.py` نام گذاری نکنید زیرا با خود فلاسک در تضاد است.

source: To run the application, use the :command:`flask` command or :command:`python -m flask`. Before you can do that you need to tell your terminal the application to work with by exporting the ``FLASK_APP`` environment variable:
fa: برای اجرای برنامه، از دستور :command:`flask` یا :command:`python -m flask` استفاده کنید. قبل از اینکه این کار را انجام دهید، باید به ترمینال خود بگویید که متغیر محیطی ``FLASK_APP`` را صادر کند تا برنامه با آن کار کند:

source: Application Discovery Behavior
fa: رفتار کشف برنامه

source: As a shortcut, if the file is named ``app.py`` or ``wsgi.py``, you don't have to set the ``FLASK_APP`` environment variable. See :doc:`/cli` for more details.
fa: به عنوان راه میانبر، اگر نام فایل ``app.py`` یا ``wsgi.py`` باشد، لازم نیست متغیر محیطی ``FLASK_APP`` را تنظیم کنید. برای جزئیات بیشتر به :doc:`/cli` مراجعه کنید.

source: This launches a very simple builtin server, which is good enough for testing but probably not what you want to use in production. For deployment options see :doc:`deploying/index`.
fa: این یک سرور داخلی بسیار ساده را راه اندازی می کند که برای آزمایش به اندازه کافی خوب است اما احتمالاً آن چیزی نیست که می خواهید در تولید استفاده کنید. برای گزینه های استقرار به :doc:`deploying/index` مراجعه کنید.

source: Now head over to http://127.0.0.1:5000/, and you should see your hello world greeting.
fa: اکنون به http://127.0.0.1:5000/ بروید، و باید سلام جهان را ببینید.

source: If another program is already using port 5000, you'll see ``OSError: [Errno 98]`` or ``OSError: [WinError 10013]`` when the server tries to start. See :ref:`address-already-in-use` for how to handle that.
fa: اگر برنامه دیگری در حال حاضر از پورت 5000 استفاده می کند، زمانی که سرور تلاش می کند راه اندازی شود، ``OSError: [WinError 10013]`` یا ``OSError: [Errno 98]`` را مشاهده خواهید کرد. برای نحوه رسیدگی به آن به :ref:`address-already-in-use` مراجعه کنید.

source: Externally Visible Server
fa: سرور قابل مشاهده خارجی

source: If you run the server you will notice that the server is only accessible from your own computer, not from any other in the network. This is the default because in debugging mode a user of the application can execute arbitrary Python code on your computer.
fa: اگر سرور را اجرا کنید، متوجه خواهید شد که سرور فقط از طریق رایانه شخصی شما قابل دسترسی است، نه از هیچ رایانه دیگری در شبکه. این پیش‌فرض است زیرا در حالت اشکال‌زدایی، کاربر برنامه می‌تواند کد پایتون دلخواه را روی رایانه شما اجرا کند.

source: If you have the debugger disabled or trust the users on your network, you can make the server publicly available simply by adding ``--host=0.0.0.0`` to the command line::
fa: اگر دیباگر را غیرفعال کرده اید یا به کاربران شبکه خود اعتماد دارید، می توانید سرور را به سادگی با افزودن ``--host=0.0.0.0`` به خط فرمان در دسترس عموم قرار دهید:

source: This tells your operating system to listen on all public IPs.
fa: این به سیستم عامل شما می گوید که به تمام IP های عمومی گوش دهد.

source: What to do if the Server does not Start
fa: اگر سرور راه اندازی نشد چه باید کرد

source: In case the :command:`python -m flask` fails or :command:`flask` does not exist, there are multiple reasons this might be the case. First of all you need to look at the error message.
fa: در صورتی که :command:`python -m flask` از کار بیفتد یا :command:`flask` وجود نداشته باشد، دلایل متعددی ممکن است وجود داشته باشد. اول از همه باید به پیام خطا نگاه کنید.

source: Old Version of Flask
fa: نسخه قدیمی فلاسک

source: Versions of Flask older than 0.11 used to have different ways to start the application. In short, the :command:`flask` command did not exist, and neither did :command:`python -m flask`. In that case you have two options: either upgrade to newer Flask versions or have a look at :doc:`/server` to see the alternative method for running a server.
fa: در نسخه های ۰.۱۱ و قبل از آن تفاوتی در اجرای برنامه بود. به صورت کوتاه، :command:`flask` و :command:`python -m flask` وجود خارجی نداشتند. در این حالت شما دو انتخاب داشتید: یا فلاسک را به نسخه های جدیدتر بروز کنید یا :doc:`/server` را بررسی می کردید تا روشی تناوبی برای اجرای سرور بیابید.

source: Invalid Import Name
fa: وارد کردن اسم نامعتبر

source: The ``FLASK_APP`` environment variable is the name of the module to import at :command:`flask run`. In case that module is incorrectly named you will get an import error upon start (or if debug is enabled when you navigate to the application). It will tell you what it tried to import and why it failed.
fa: متغیر محیطی ``FLASK_APP`` نام ماژولی است که باید در :command:`flask run` وارد شود. در صورتی که نام آن ماژول اشتباه باشد، هنگام شروع با خطای وارد کردن مواجه خواهید شد (یا اگر هنگام رفتن به برنامه، اشکال زدایی فعال باشد). به شما می گوید که چه چیزی را وارد کرده و چرا شکست خورده است.

source: The most common reason is a typo or because you did not actually create an ``app`` object.
fa: رایج‌ترین دلیل اشتباه تایپی است یا اینکه شما واقعاً یک شی ``app`` ایجاد نکرده‌اید.

source: Debug Mode
fa: حالت اشکال زدایی

source: The ``flask run`` command can do more than just start the development server. By enabling debug mode, the server will automatically reload if code changes, and will show an interactive debugger in the browser if an error occurs during a request.
fa: دستور ``flask run`` میتواند کار های بیشتری از توسعه سرور انجام دهد. با فعال سازی حالت اشکال زدایی سرور درصورت تغییر کد به صورت خودکار باز راه‌اندازی میشود و در صورت بروز خطا در هنگام درخواست، یک دیباگر تعاملی را در مرورگر نشان می دهد.

source: The debugger allows executing arbitrary Python code from the browser. It is protected by a pin, but still represents a major security risk. Do not run the development server or debugger in a production environment.
fa: دیباگر اجازه می دهد تا کد پایتون دلخواه را از مرورگر اجرا کنید. توسط یک پین محافظت می شود، اما همچنان یک خطر امنیتی بزرگ است. سرور توسعه یا دیباگر را در محیط تولید اجرا نکنید.

source: To enable all development features, set the ``FLASK_ENV`` environment variable to ``development`` before calling ``flask run``.
fa: برای فعال سازی تمام قابلیت های توسعه، قبل از اجرای ``flask run`` ، متغیر محیطی ``FLASK_ENV`` را برابر ``development`` قرار دهید.

source: See also:
fa: همچنین ببینید:

source: :doc:`/server` and :doc:`/cli` for information about running in development mode.
fa: برای اطلاعات درباره اجرا در حالت توسعه :doc:`/server` و :doc:`/cli` را ببینید.

source: :doc:`/debugging` for information about using the built-in debugger and other debuggers.
fa: برای اطلاعات درباره دیباگر داخلی و سایر دیباگر ها :doc:`/debugging` ببینید.

source: :doc:`/logging` and :doc:`/errorhandling` to log errors and display nice error pages.
fa: :doc:`/logging` و :doc:`/errorhandling` را برای لاگ های ارور و نمایش بهتر صفحات ارور ببینید.

source: HTML Escaping
fa: فرار HTML (HTML Escaping)

source: When returning HTML (the default response type in Flask), any user-provided values rendered in the output must be escaped to protect from injection attacks. HTML templates rendered with Jinja, introduced later, will do this automatically.
fa: هنگام برگرداندن HTML (نوع پاسخ پیش‌فرض در فلاسک)، هر مقدار ارائه‌شده توسط کاربر که در خروجی ارائه می‌شود، باید برای محافظت در برابر حملات XSS مقاوم باشند. قالب‌های HTML ارائه‌شده با Jinja، که بعداً معرفی شدند، این کار را به‌طور خودکار انجام می‌دهند.

source: :func:`~markupsafe.escape`, shown here, can be used manually. It is omitted in most examples for brevity, but you should always be aware of how you're using untrusted data.
fa: تابع :func:`~markupsafe.escape`، که در اینجا نشان داده شده است، می تواند به صورت دستی استفاده شود. در بیشتر نمونه ها برای اختصار از آن حذف شده است، اما همیشه باید از نحوه استفاده از داده های نامعتبر آگاه باشید.

source: If a user managed to submit the name ``<script>alert("bad")</script>``, escaping causes it to be rendered as text, rather than running the script in the user's browser.
fa: اگر کاربر موفق به ارسال ``<script>alert("bad")</script>`` شود، فرار باعث می شود که به جای اجرای اسکریپت در مرورگر کاربر، به صورت متن ارائه شود.

source: ``<name>`` in the route captures a value from the URL and passes it to the view function. These variable rules are explained below.
fa: ``<name>`` در مسیر یک مقدار از URL گرفته و به تابع view ارسال می کند. این قوانین متغیر در زیر توضیح داده شده است.

source: Routing
fa: مسیریابی

source: Modern web applications use meaningful URLs to help users. Users are more likely to like a page and come back if the page uses a meaningful URL they can remember and use to directly visit a page.
fa: برنامه های وب مدرن از URL های معنی دار برای کمک به کاربران استفاده می کنند. اگر کاربران یک صفحه را دوست داشته باشند و اگر صفحه از URL معنی‌داری استفاده کند، کاربران می‌توانند URL را به خاطر بسپارند و مستقیماً از صفحه بازدید کنند.

source: Use the :meth:`~flask.Flask.route` decorator to bind a function to a URL. ::
fa: از دکوراتور :meth:`~flask.Flask.route` برای اتصال یک تابع به URL استفاده کنید. ::

source: You can do more! You can make parts of the URL dynamic and attach multiple rules to a function.
fa: شما میتوانید کار های زیادی را انجام دهید! میتوانید بخشی از URL را پویا کنید و چند قانون به تابع اضافه کنید.

source: Variable Rules
fa: قوانین متغیر

source: You can add variable sections to a URL by marking sections with ``<variable_name>``. Your function then receives the ``<variable_name>`` as a keyword argument. Optionally, you can use a converter to specify the type of the argument like ``<converter:variable_name>``. ::
fa: می‌توانید با علامت‌گذاری بخش‌ها با ``<variable_name>`` ، بخش‌هایی از متغیر را به URL اضافه کنید. سپس تابع شما ``<variable_name>`` را به عنوان آرگومان کلمه کلیدی دریافت می کند. به صورت اختیاری، می توانید از یک مبدل برای تعیین نوع آرگومان مانند ``<converter:variable_name>`` استفاده کنید. ::

source: Converter types:
fa: انواع مبدل:

source: ``string``
fa: ``رشته``

source: (default) accepts any text without a slash
fa: به صورت پیشفرض هر متنی را بدون اسلش می پذیرد

source: ``int``
fa: ``عدد صحیح``

source: accepts positive integers
fa: اعداد صحیح مثبت را می پذیرد

source: ``float``
fa: ``عدد اعشاری``

source: accepts positive floating point values
fa: تمام اعداد اعشاری مثبت را می پذیرد

source: ``path``
fa: ``مسیر``

source: like ``string`` but also accepts slashes
fa: مانند ``رشته`` است ولی اسلش را هم می پذیرد

source: accepts UUID strings
fa: رشته های UUID را می پذیرد

source: Unique URLs / Redirection Behavior
fa: URL های منحصر به فرد / رفتار تغییر مسیر

source: The following two rules differ in their use of a trailing slash. ::
fa: دو قانون زیر در استفاده از اسلش انتهایی متفاوت است. ::

source: The canonical URL for the ``projects`` endpoint has a trailing slash. It's similar to a folder in a file system. If you access the URL without a trailing slash (``/projects``), Flask redirects you to the canonical URL with the trailing slash (``/projects/``).
fa: URL متعارف برای نقطه پایانی ``projects`` دارای یک اسلش انتهایی است. این شبیه به یک پوشه در یک سیستم فایل است. اگر بدون اسلش انتهایی (``/projects``) به URL دسترسی داشته باشید، Flask شما را به URL متعارف با اسلش انتهایی (``/projects/``) هدایت می کند.

source: The canonical URL for the ``about`` endpoint does not have a trailing slash. It's similar to the pathname of a file. Accessing the URL with a trailing slash (``/about/``) produces a 404 "Not Found" error. This helps keep URLs unique for these resources, which helps search engines avoid indexing the same page twice.
fa: URL متعارف برای نقطه پایانی ``about`` دارای یک اسلش انتهایی نیست. این شبیه به نام مسیر یک فایل است. دسترسی به URL با اسلش انتهایی (``/about/``) باعث ایجاد خطای ۴۰۴ «یافت نشد» می شود. این کمک می کند تا URL ها برای این منابع منحصر به فرد باقی بمانند، که به موتورهای جستجو کمک می کند تا از نمایه سازی یک صفحه دو بار جلوگیری کنند.

source: URL Building
fa: ساخت URL

source: To build a URL to a specific function, use the :func:`~flask.url_for` function. It accepts the name of the function as its first argument and any number of keyword arguments, each corresponding to a variable part of the URL rule. Unknown variable parts are appended to the URL as query parameters.
fa: برای ساخت یک URL برای یک تابع خاص، از تابع :func:`~flask.url_for` استفاده کنید. نام تابع را به عنوان اولین آرگومان و هر تعداد آرگومان کلمه کلیدی که هر کدام مربوط به بخش متغیری از قانون URL است را می پذیرد. قسمت های متغیر ناشناخته به عنوان پارامترهای پرس و جو به URL اضافه می شوند.

source: Why would you want to build URLs using the URL reversing function :func:`~flask.url_for` instead of hard-coding them into your templates?
fa: چرا می خواهید URL ها را با استفاده از تابع :func:`~flask.url_for` بسازید به جای آنکه کد ها را در قالب های خود بنویسید؟

source: Reversing is often more descriptive than hard-coding the URLs.
fa: معکوس کردن اغلب توصیفی از کدگذاری سخت URL ها است.

source: You can change your URLs in one go instead of needing to remember to manually change hard-coded URLs.
fa: می‌توانید به‌جای اینکه به یاد داشته باشید که URL‌های کدگذاری‌شده را به‌صورت دستی تغییر دهید، آدرس‌های اینترنتی خود را یکباره تغییر دهید.

source: URL building handles escaping of special characters transparently.
fa: ساختمان فرار URL از کاراکترهای خاص را به طور شفاف کنترل می کند.

source: The generated paths are always absolute, avoiding unexpected behavior of relative paths in browsers.
fa: مسیرهای تولید شده همیشه مطلق هستند و از رفتار غیرمنتظره مسیرهای وابسته در مرورگرها جلوگیری می کنند.

source: If your application is placed outside the URL root, for example, in ``/myapplication`` instead of ``/``, :func:`~flask.url_for` properly handles that for you.
fa: اگر برنامه شما خارج از ریشه URL قرار داده شده است، به عنوان مثال، به جای ``/`` در ``/myapplication`` باشد، :func:`~flask.url_for` به درستی آن را برای شما مدیریت می کند.

source: For example, here we use the :meth:`~flask.Flask.test_request_context` method to try out :func:`~flask.url_for`. :meth:`~flask.Flask.test_request_context` tells Flask to behave as though it's handling a request even while we use a Python shell. See :ref:`context-locals`.
fa: به عنوان مثال، در اینجا از روش :meth:`~flask.Flask.test_request_context` برای امتحان کردن :func:`~flask.url_for` استفاده می کنیم. :meth:`~flask.Flask.test_request_context` به فلاسک می گوید که به گونه ای رفتار کند که انگار در حال رسیدگی به یک درخواست است حتی زمانی که ما از پوسته پایتون استفاده می کنیم. به :ref:`context-locals` مراجعه کنید.

source: HTTP Methods
fa: متود های HTTP

source: Web applications use different HTTP methods when accessing URLs. You should familiarize yourself with the HTTP methods as you work with Flask. By default, a route only answers to ``GET`` requests. You can use the ``methods`` argument of the :meth:`~flask.Flask.route` decorator to handle different HTTP methods. ::
fa: برنامه های کاربردی وب هنگام دسترسی به URL ها از روش های مختلف HTTP استفاده می کنند. هنگام کار با فلاسک باید با روش های HTTP آشنا شوید. به طور پیش‌فرض، یک مسیر فقط به درخواست‌های ``GET`` پاسخ می‌دهد. می‌توانید از آرگومان``methods`` دکوراتور :meth:`~flask.Flask.route` برای مدیریت روش‌های مختلف HTTP استفاده کنید. ::

source: If ``GET`` is present, Flask automatically adds support for the ``HEAD`` method and handles ``HEAD`` requests according to the `HTTP RFC`_. Likewise, ``OPTIONS`` is automatically implemented for you.
fa: اگر ``GET`` وجود داشته باشد، فلاسک به طور خودکار از روش ``HEAD`` پشتیبانی می‌کند و درخواست‌های «HEAD» را مطابق با `HTTP RFC`_ مدیریت می‌کند. به همین ترتیب، ``OPTIONS`` به طور خودکار برای شما پیاده سازی می شود.

source: Static Files
fa: فایل های استاتیک

source: Dynamic web applications also need static files. That's usually where the CSS and JavaScript files are coming from. Ideally your web server is configured to serve them for you, but during development Flask can do that as well. Just create a folder called :file:`static` in your package or next to your module and it will be available at ``/static`` on the application.
fa: برنامه های وب پویا به فایل های استاتیک نیز نیاز دارند. معمولاً فایل های CSS و جاوا اسکریپت از آنجا می آیند. در حالت ایده آل وب سرور شما به گونه ای پیکربندی شده است که آنها را برای شما ارائه دهد، اما در حین توسعه، فلاسک می تواند این کار را نیز انجام داد. فقط یک پوشه به نام :file:`static` در پکیج خود یا در کنار ماژول خود ایجاد کنید و در آدرس ``/static`` در برنامه در دسترس خواهد بود.

source: To generate URLs for static files, use the special ``'static'`` endpoint name::
fa: برای ایجاد URL برای فایل‌های استاتیک، از نام نقطه پایانی ویژه ``'static'`` استفاده کنید::

source: The file has to be stored on the filesystem as :file:`static/style.css`.
fa: فایل باید در سیستم فایل به صورت :file:`static/style.css` ذخیره شود.

source: Rendering Templates
fa: الگوهای رندرینگ

source: Generating HTML from within Python is not fun, and actually pretty cumbersome because you have to do the HTML escaping on your own to keep the application secure. Because of that Flask configures the `Jinja2 <https://palletsprojects.com/p/jinja/>`_ template engine for you automatically.
fa: تولید HTML از داخل پایتون سرگرم کننده نیست، و در واقع بسیار دست و پا گیر است، زیرا برای ایمن نگه داشتن برنامه، باید HTML را به تنهایی انجام دهید. به همین دلیل فلاسک موتور قالب `Jinja2 <https://palletsprojects.com/p/jinja/>`_ را به طور خودکار برای شما پیکربندی می کند.

source: To render a template you can use the :func:`~flask.render_template` method. All you have to do is provide the name of the template and the variables you want to pass to the template engine as keyword arguments. Here's a simple example of how to render a template::
fa: برای رندر یک الگو می توانید از روش :func:`~flask.render_template` استفاده کنید. تنها کاری که باید انجام دهید این است که نام قالب و متغیرهایی را که می خواهید به عنوان آرگومان های کلمه کلیدی به موتور قالب منتقل کنید، ارائه دهید. در اینجا یک مثال ساده از نحوه ارائه یک الگو آورده شده است:

source: Flask will look for templates in the :file:`templates` folder. So if your application is a module, this folder is next to that module, if it's a package it's actually inside your package:
fa: فلاسک دارای مقادیر زیادی از پیکربندی با پیش فرض های معقول، و چند قرارداد در هنگام شروع است. طبق قرارداد، قالب‌ها و فایل‌های استاتیک در زیرشاخه‌های منبع برنامه، با نام‌ های :file:`templates` و :file:`static` ذخیره می‌شوند. البته میتوان آنها را تغییر داد ولی معمولا به خصوص در هنگام شروع مجبور نیستید که آنها را تغییر دهید:

source: **Case 1**: a module::
fa: **مورد ۱**: یک ماژول::

source: **Case 2**: a package::
fa: **مورد ۲**: یک ماژول::

source: For templates you can use the full power of Jinja2 templates. Head over to the official `Jinja2 Template Documentation <https://jinja.palletsprojects.com/templates/>`_ for more information.
fa: برای قالب ها می توانید از قدرت کامل قالب های Jinja2 استفاده کنید. برای اطلاعات بیشتر به `مستندات الگوی jinja2 <https://jinja.palletsprojects.com/templates/>`_ مراجعه کنید.

source: Here is an example template:
fa: اینجا یک مثال برای قالب است:

source: Inside templates you also have access to the :data:`~flask.Flask.config`, :class:`~flask.request`, :class:`~flask.session` and :class:`~flask.g` [#]_ objects as well as the :func:`~flask.url_for` and :func:`~flask.get_flashed_messages` functions.
fa: در داخل الگوها همچنین به :data:`~flask.Flask.config`, :class:`~flask.request`, :class:`~flask.session` و :class:`~flask.g` [#]_ و همچنین به توابع :func:`~flask.url_for` و :func:`~flask.get_flashed_messages` دسترسی دارید.

source: Templates are especially useful if inheritance is used. If you want to know how that works, see :doc:`patterns/templateinheritance`. Basically template inheritance makes it possible to keep certain elements on each page (like header, navigation and footer).
fa: اگر از وراثت استفاده میکنید.، الگوها بسیار مفید هستند. اگر می خواهید بدانید که چگونه کار می کند، به :doc:`patterns/templateinheritance` مراجعه کنید. اساساً، وراثت قالب، نگه داشتن عناصر خاصی را در هر صفحه (مانند هدر، ناوبری و پاورقی) ممکن می‌سازد.

source: Automatic escaping is enabled, so if ``name`` contains HTML it will be escaped automatically. If you can trust a variable and you know that it will be safe HTML (for example because it came from a module that converts wiki markup to HTML) you can mark it as safe by using the :class:`~markupsafe.Markup` class or by using the ``|safe`` filter in the template. Head over to the Jinja 2 documentation for more examples.
fa: فرار خودکار فعال است، بنابراین اگر ``name`` حاوی HTML باشد، به طور خودکار از آن خنثی میکند. اگر می‌توانید به متغیری اعتماد کنید و می‌دانید که HTML ایمن خواهد بود (مثلاً چون از ماژولی است که نشانه‌گذاری ویکی را به HTML تبدیل می‌کند)، می‌توانید با استفاده از کلاس :class:`~markupsafe.Markup` آن را به عنوان امن علامت‌گذاری کنید. یا با استفاده از فیلتر ``|safe`` در الگو اینکار را انجام دهید. برای نمونه های بیشتر به مستندات Jinja 2 بروید.

source: Here is a basic introduction to how the :class:`~markupsafe.Markup` class works::
fa: در اینجا یک مقدمه اولیه برای نحوه عملکرد کلاس :class:`~markupsafe.Markup` آورده شده است::

source: Autoescaping is no longer enabled for all templates. The following extensions for templates trigger autoescaping: ``.html``, ``.htm``, ``.xml``, ``.xhtml``. Templates loaded from a string will have autoescaping disabled.
fa: فرار خودکار دیگر برای همه الگوها فعال نیست. فرار خودکار برای پسوند های زیر انجام میشود: : ``.html``, ``.htm``, ``.xml``, ``.xhtml``. الگوهای بارگذاری شده از یک رشته، فرار خودکار را غیر فعال خواهد کرد.
