Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/server.po
Languages: fa

source: Development Server
fa: سرور توسعه

source: Flask provides a ``run`` command to run the application with a development server. In debug mode, this server provides an interactive debugger and will reload when code is changed.
fa: فلسک برای راه اندازی اپلیکیشن یک دستور ``run`` فراهم کرده با یک محیط توسعه. در حالت خطایاب, این سرور یک خطایاب تعاملی و بارگزاری مجدد تغییرات اعمال شده در کد را فراهم میکند.

source: Do not use the development server when deploying to production. It is intended for use only during local development. It is not designed to be particularly efficient, stable, or secure.
fa: از محیط توسعه در زمان پیاده کردن اپلیکیشن استفاده نکنید. زیرا فقط برای استفاده در حین توسعه محلی در نظر گرفته شده. و همچنین برای کارآمدی, پایداری و امن بودن طراحی نشده.

source: See :doc:`/deploying/index` for deployment options.
fa: برای دیدن امکانات پیاده سازی :doc:`/deploying/index` را ببینید.

source: Command Line
fa: خط دستور

source: The ``flask run`` CLI command is the recommended way to run the development server. Use the ``--app`` option to point to your application, and the ``--debug`` option to enable debug mode.
fa: راه پیشنهادی برای راه اندازی محیط توسعه دستور ``flask run`` میباشد. از سوییچ ``app--`` برای اشاره به برنامه خود و همچنین از ``debug--`` برای فعال کردن حالت خطایاب استفاده کنید.

source: This enables debug mode, including the interactive debugger and reloader, and then starts the server on http://localhost:5000/. Use ``flask run --help`` to see the available options, and :doc:`/cli` for detailed instructions about configuring and using the CLI.
fa: این دستور حالت خطایاب را فعال میکند, از جمله خطایاب تعاملی و بارگذار کننده مجدد, و سپس سرور را بر http://localhost:5000 راه اندازی میکند. برای دیدن امکانات قابل استفاده از ``flask run --help `` و همچنین از :doc:`/cli` برای جزئیات دستورالعمل های مربوط به پیکربندی و استفاده از خط دستور استفاده کنید.

source: Address already in use
fa: آدرس در حال استفاده

source: If another program is already using port 5000, you'll see an ``OSError`` when the server tries to start. It may have one of the following messages:
fa: اگر برنامه دیگری در حال استفاده از پورت 5000 است, یک ``OSError`` را خواهید دید زمانی که سرور در حال تلاش برای راه اندازی است. احتمالا یکی از پیام های زیر را دریافت خواهید کرد:

source: Either identify and stop the other program, or use ``flask run --port 5001`` to pick a different port.
fa: یا برنامه دیگر را شناسایی و متوقف کنید, یا از ``flask run --port "5001`` برای استفاده از یک پورت دیگر استفاده کنید.

source: You can use ``netstat`` or ``lsof`` to identify what process id is using a port, then use other operating system tools stop that process. The following example shows that process id 6847 is using port 5000.
fa: میتوانید از ``netstat`` یا ``lsof`` برای شناسایی شماره پروسه ای که درحال استفاده از یک پورت است استفاده کنید, و یا از دیگر ابزار های سیستم عامل برای متوقف سازی آن پروسه. مثال روبه رو شماره پروسه 6847 را در حال استفاده از پورت 5000 نشان میدهد.

source: macOS Monterey and later automatically starts a service that uses port 5000. You can choose to disable this service instead of using a different port by searching for "AirPlay Receiver" in System Preferences and toggling it off.
fa: مک اواس monterey و دیگر نسخه ها به صورت خودکار سرویسی را راه اندازی میکنند که از پورت 5000 استفاده میکند. میتوانید به جای استفاده از پورت دیگری با جستجو برای "AirPlay Receiver" در System Preferences و خاموش کردن آن آن سرویس دیگر را خاموش کنید.

source: Deferred Errors on Reload
fa: خطاهای به تعویق افتاده در بارگزاری مجدد

source: When using the ``flask run`` command with the reloader, the server will continue to run even if you introduce syntax errors or other initialization errors into the code. Accessing the site will show the interactive debugger for the error, rather than crashing the server.
fa: زمانی که از دستور ``flask run`` با بارگزار کننده مجدد استفاده میکنید, سرور راه اندازی برنامه را ادامه خواهد داد حتی اگر شما خطاهای سینتکس و یا دیگر خطاهای اولیه در کد را مرتکب شوید. دسترسی به سایت خطایاب تعاملی را برای خطاها نمایش خواهد داد, به جای خراب شدن سرور.

source: If a syntax error is already present when calling ``flask run``, it will fail immediately and show the traceback rather than waiting until the site is accessed. This is intended to make errors more visible initially while still allowing the server to handle errors on reload.
fa: اگر خطای سینتکس قبل از فراخوانی ``flask run`` رخ دهد, فورا از کار خواهد افتاد و رد خطا را به جای منتظر ماندن نمایش خواهد داد تا زمانی که سایت قابل دسترسی باشد. این در ابتدا جهت بیشتر نمایان کردن خطاهاست و در عین حال به سرور اجازه میدهد تا خطاها را هنگام بارگذاری مجدد مدیریت کند.

source: In Code
fa: در کد

source: The development server can also be started from Python with the :meth:`Flask.run` method. This method takes arguments similar to the CLI options to control the server. The main difference from the CLI command is that the server will crash if there are errors when reloading. ``debug=True`` can be passed to enable debug mode.
fa: همچنین سرور توسعه میتواند از پایتون راه اندازی شود با متود :meth:`Flask.run`. این متود ورودی های مشابه امکانات خط دستوری را برای کنترل کردن سرور دریافت میکند. تفاوت اصلی آن با دستور خط دستوری این است که درصورتی که خطایی هنگام بارگزاری مجدد وجود داشته باشد سرور خراب خواهد شد. ``debug=True`` را میتوان برای فعال سازی حالت خطایابی ارسال کرد.

source: Place the call in a main block, otherwise it will interfere when trying to import and run the application with a production server later.
fa: فراخوانی را در یک بخش اصلی بگذارید, در غیر این صورت هنگام تلاش برای وارد کردن و اجرای برنامه با سرور تداخل ایجاد خواهد کرد
