Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/tutorial/deploy.po
Languages: fa

source: Deploy to Production
fa: استقرار برای کار(Deploy to Production)

source: This part of the tutorial assumes you have a server that you want to deploy your application to. It gives an overview of how to create the distribution file and install it, but won't go into specifics about what server or software to use. You can set up a new environment on your development computer to try out the instructions below, but probably shouldn't use it for hosting a real public application. See :doc:`/deploying/index` for a list of many different ways to host your application.
fa: این قسمت از آموزش فرض می کند که شما سروری دارید که می خواهید برنامه خود را در آن مستقر کنید. این یک نمای کلی از نحوه ایجاد فایل توزیع و نصب آن را ارائه می دهد، اما به جزئیات در مورد سرور یا نرم افزار مورد استفاده نمی پردازد. می‌توانید یک محیط جدید در رایانه توسعه‌دهنده خود راه‌اندازی کنید تا دستورالعمل‌های زیر را امتحان کنید، اما احتمالاً نباید از آن برای میزبانی یک برنامه عمومی واقعی استفاده کنید. برای فهرستی از روش‌های مختلف میزبانی برنامه، به :doc:`/deploying/index` مراجعه کنید.

source: Build and Install
fa: ساخت و نصب

source: When you want to deploy your application elsewhere, you build a distribution file. The current standard for Python distribution is the *wheel* format, with the ``.whl`` extension. Make sure the wheel library is installed first:
fa: هنگامی که می خواهید برنامه خود را در جای دیگری مستقر کنید، یک فایل توزیع می سازید. استاندارد فعلی برای توزیع پایتون فرمت *wheel* با پسوند ``.whl`` است. ابتدا مطمئن شوید که کتابخانه wheel نصب شده باشد:

source: Running ``setup.py`` with Python gives you a command line tool to issue build-related commands. The ``bdist_wheel`` command will build a wheel distribution file.
fa: اجرای ``setup.py`` با پایتون به شما یک ابزار خط فرمان برای صدور دستورات مربوط به ساخت می دهد. دستور ``bdist_wheel`` یک فایل توزیع wheel می‌سازد.

source: You can find the file in ``dist/flaskr-1.0.0-py3-none-any.whl``. The file name is in the format of {project name}-{version}-{python tag} -{abi tag}-{platform tag}.
fa: می توانید فایل را در ``dist/flaskr-1.0.0-py3-none-any.whl`` پیدا کنید. نام فایل در قالب {project name}-{version}-{python tag} -{abi tag}-{platform tag} می باشد.

source: Copy this file to another machine, :ref:`set up a new virtualenv <install-create-env>`, then install the file with ``pip``.
fa: این فایل را در دستگاه دیگری کپی کنید، :ref:`یک virualenv را راه‌اندازی کنید <install-create-env>` ، سپس فایل را با ``pip`` نصب کنید.

source: Pip will install your project along with its dependencies.
fa: Pip پروژه شما را به همراه وابستگی های آن نصب می کند.

source: Since this is a different machine, you need to run ``init-db`` again to create the database in the instance folder.
fa: از آنجایی که این یک ماشین متفاوت است، برای ایجاد پایگاه داده در پوشه نمونه، باید ``init-db`` را دوباره اجرا کنید.

source: Bash
fa: بش(Bash)

source: CMD
fa: سی ام دی(CMD)

source: Powershell
fa: پاورشل(Powershell)

source: When Flask detects that it's installed (not in editable mode), it uses a different directory for the instance folder. You can find it at ``venv/var/flaskr-instance`` instead.
fa: هنگامی که فلاسک تشخیص می دهد که نصب شده است (در حالت قابل ویرایش نیست)، از دایرکتوری دیگری برای پوشه نمونه استفاده می کند. در عوض می‌توانید آن را در ``venv/var/flaskr-instance`` پیدا کنید.

source: Configure the Secret Key
fa: پیکربندی کلید مخفی(Secret Key)

source: In the beginning of the tutorial that you gave a default value for :data:`SECRET_KEY`. This should be changed to some random bytes in production. Otherwise, attackers could use the public ``'dev'`` key to modify the session cookie, or anything else that uses the secret key.
fa: در ابتدای آموزش که یک مقدار پیش فرض برای :data:`SECRET_KEY` دادید. این باید به چند بایت تصادفی در تولید تغییر کند. در غیر این صورت، مهاجمان می‌توانند از کلید عمومی ``'dev'`` برای اصلاح کوکی جلسه یا هر چیز دیگری که از کلید مخفی استفاده می‌کند استفاده کنند.

source: You can use the following command to output a random secret key:
fa: برای دریافت یک کلید مخفی تصادفی می توانید از دستور زیر استفاده کنید:

source: Create the ``config.py`` file in the instance folder, which the factory will read from if it exists. Copy the generated value into it.
fa: فایل ``config.py`` را در پوشه نمونه ایجاد کنید که در صورت وجود، کارخانه از آن می خواند. مقدار تولید شده را در آن کپی کنید.

source: You can also set any other necessary configuration here, although ``SECRET_KEY`` is the only one needed for Flaskr.
fa: همچنین می‌توانید هر پیکربندی ضروری دیگری را در اینجا تنظیم کنید، اگرچه ``SECRET_KEY`` تنها مورد نیاز برای Flaskr است.

source: Run with a Production Server
fa: اجرای یک سرور کار(Production)

source: When running publicly rather than in development, you should not use the built-in development server (``flask run``). The development server is provided by Werkzeug for convenience, but is not designed to be particularly efficient, stable, or secure.
fa: هنگام اجرای عمومی به جای توسعه، نباید از سرور توسعه داخلی استفاده کنید ( ``flask run`` ). سرور توسعه توسط Werkzeug برای راحتی ارائه شده است، اما به گونه ای طراحی نشده است که کارآمد، پایدار یا ایمن باشد.

source: Instead, use a production WSGI server. For example, to use `Waitress`_, first install it in the virtual environment:
fa: در عوض، از سرور WSGI تولیدی استفاده کنید. به عنوان مثال، برای استفاده از `Waitress`_, ، ابتدا آن را در محیط مجازی نصب کنید:

source: You need to tell Waitress about your application, but it doesn't use ``FLASK_APP`` like ``flask run`` does. You need to tell it to import and call the application factory to get an application object.
fa: شما باید به Waitress در مورد برنامه خود بگویید، اما از ``FLASK_APP`` مانند ``flask run`` استفاده نمی کند. شما باید به آن بگویید وارد کند و از کارخانه برنامه استفاده کند تا یک شی برنامه را دریافت کند.

source: See :doc:`/deploying/index` for a list of many different ways to host your application. Waitress is just an example, chosen for the tutorial because it supports both Windows and Linux. There are many more WSGI servers and deployment options that you may choose for your project.
fa: برای فهرستی از روش‌های مختلف میزبانی برنامه، به :doc:`/deploying/index` مراجعه کنید. Waitress فقط یک مثال است که برای آموزش انتخاب شده است زیرا از ویندوز و لینوکس پشتیبانی می کند. سرورهای WSGI و گزینه های استقرار بیشتری وجود دارد که می توانید برای پروژه خود انتخاب کنید.

source: Continue to :doc:`next`.
fa: با :doc:`next` ادامه دهید.
