Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/tutorial/index.po
Languages: fa

source: Contents:
fa: فهرست:

source: Tutorial
fa: آموزش

source: This tutorial will walk you through creating a basic blog application called Flaskr. Users will be able to register, log in, create posts, and edit or delete their own posts. You will be able to package and install the application on other computers.
fa: این آموزش شما را در ایجاد یک برنامه وبلاگ پایه به نام Flaskr راهنمایی می کند. کاربران می توانند ثبت نام کنند، وارد شوند، پست ایجاد کنند و پست های خود را ویرایش یا حذف کنند. شما قادر خواهید بود برنامه را بر روی رایانه های دیگر بسته بندی و نصب کنید.

source: screenshot of index page
fa: اسکرین شات صفحه اصلی

source: It's assumed that you're already familiar with Python. The `official tutorial`_ in the Python docs is a great way to learn or review first.
fa: این آموزش فرض میکند که شما به زبان پایتون آشنا هستید. `official tutorial`_ یک راه عالی برای یادگیری یا بررسی اولیه پایتون است.

source: While it's designed to give a good starting point, the tutorial doesn't cover all of Flask's features. Check out the :doc:`/quickstart` for an overview of what Flask can do, then dive into the docs to find out more. The tutorial only uses what's provided by Flask and Python. In another project, you might decide to use :doc:`/extensions` or other libraries to make some tasks simpler.
fa: در حالی این آموزش برای یک نقطه شروع خوب طراحی شده است اما همه قابلیت های فلاسک را پوشش نمیدهد. برای بررسی اولیه اینکه فلاسک چکار میکند، :doc:`/quickstart` را ببینید سپس به سایر مستندات بروید تا چیز های دیگر را پیدا کنید. این آموزش فقط برای پایتون و چیستی فلاسک تهیه شده است. برای سایر پروژه ها شما میتوانید تصمیم بگیرید که از :doc:`/extensions` یا سایر کتابخانه ها اندک ساخته شده استفاده کنید.

source: screenshot of login page
fa: اسکرین شات صفحه ورود

source: Flask is flexible. It doesn't require you to use any particular project or code layout. However, when first starting, it's helpful to use a more structured approach. This means that the tutorial will require a bit of boilerplate up front, but it's done to avoid many common pitfalls that new developers encounter, and it creates a project that's easy to expand on. Once you become more comfortable with Flask, you can step out of this structure and take full advantage of Flask's flexibility.
fa: فلاسک انعطاف پذیر است. در شروع نیازی به طرح بندی خاص برای پروژه یا کد ندارد. این کمک میکند تا از بیشتر رویکرد های ساختار یافته استفاده کرد. این به این معنی است که این آموزش از قبل به مقداری تکرار واضحات نیاز دارد اما این کار برای جلوگیری از بسیاری از دام های رایجی که توسعه دهندگان جدید با آن مواجه می شوند انجام می شود و پروژه ای را ایجاد می کند که به راحتی می توان آن را گسترش داد. هنگامی که با فلاسک راحت تر شدید، می توانید از این ساختار خارج شوید و از انعطاف پذیری فلاسک نهایت استفاده را ببرید.

source: screenshot of edit page
fa: اسکرین شات صفحه ویرایش

source: :gh:`The tutorial project is available as an example in the Flask repository <examples/tutorial>`, if you want to compare your project with the final product as you follow the tutorial.
fa: :gh:`آموزش این پروژه در مثال های مخزن فلاسک در دسترس است <examples/tutorial>`. اگر شما میخواهید که پروژه خودتان و پروداکشن نهایی را مقایسه کنید، این لینک را دنبال کنید.

source: Continue to :doc:`layout`.
fa: با :doc:`layout` ادامه دهید.
