Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/tutorial/install.po
Languages: fa

source: Make the Project Installable
fa: پروژه را قابل نصب کنید

source: Making your project installable means that you can build a *distribution* file and install that in another environment, just like you installed Flask in your project's environment. This makes deploying your project the same as installing any other library, so you're using all the standard Python tools to manage everything.
fa: قابل نصب کردن پروژه به این معنی است که شما می توانید یک فایل *distribution* بسازید و آن را در محیط دیگری نصب کنید، درست همانطور که فلاسک را در محیط پروژه خود نصب کرده اید. این باعث می‌شود که پروژه شما مانند نصب هر کتابخانه دیگری باشد، بنابراین شما از تمام ابزارهای استاندارد پایتون برای مدیریت همه چیز استفاده می‌کنید.

source: Installing also comes with other benefits that might not be obvious from the tutorial or as a new Python user, including:
fa: نصب همچنین دارای مزایای دیگری است که ممکن است از طریق آموزش یا به عنوان یک کاربر جدید پایتون مشخص نباشد، از جمله:

source: Currently, Python and Flask understand how to use the ``flaskr`` package only because you're running from your project's directory. Installing means you can import it no matter where you run from.
fa: در حال حاضر، پایتون و فلاسک نحوه استفاده از بسته ``flaskr`` را فقط به این دلیل می‌دانند که شما از دایرکتوری پروژه خود در حال اجرا هستید. نصب به این معنی است که می توانید آن را بدون توجه به اینکه از کجا اجرا می کنید، وارد کنید.

source: You can manage your project's dependencies just like other packages do, so ``pip install yourproject.whl`` installs them.
fa: شما می توانید وابستگی های پروژه خود را درست مانند سایر بسته ها مدیریت کنید، بنابراین ``pip install yourproject.whl`` آنها را نصب می کند.

source: Test tools can isolate your test environment from your development environment.
fa: ابزارهای تست می توانند محیط تست شما را از محیط توسعه شما جدا کنند.

source: This is being introduced late in the tutorial, but in your future projects you should always start with this.
fa: این در اواخر آموزش معرفی شده است، اما در پروژه های آینده خود همیشه باید با این شروع کنید.

source: Describe the Project
fa: پروژه را شرح دهید

source: The ``setup.py`` file describes your project and the files that belong to it.
fa: فایل ``setup.py`` پروژه شما و فایل های متعلق به آن را توصیف می کند.

source: ``packages`` tells Python what package directories (and the Python files they contain) to include. ``find_packages()`` finds these directories automatically so you don't have to type them out. To include other files, such as the static and templates directories, ``include_package_data`` is set. Python needs another file named ``MANIFEST.in`` to tell what this other data is.
fa: ``packages`` به پایتون می‌گویند که چه دایرکتوری‌های بسته (و فایل‌های پایتون موجود در آنها) را شامل شود. ``find_packages()`` این دایرکتوری ها را به طور خودکار پیدا می کند، بنابراین شما مجبور نیستید آنها را تایپ کنید. برای گنجاندن فایل‌های دیگر، مانند فهرست‌های استاتیک و الگوها، ``include_package_data`` تنظیم شده است. پایتون به فایل دیگری به نام ``MANIFEST.in`` نیاز دارد تا بگوید این داده های دیگر چیست.

source: This tells Python to copy everything in the ``static`` and ``templates`` directories, and the ``schema.sql`` file, but to exclude all bytecode files.
fa: این به پایتون می‌گوید همه چیز را در دایرکتوری‌های ``static`` و ``templates`` و فایل ``schema.sql`` کپی کند، اما همه فایل‌های بایت کد را حذف کند.

source: See the `official packaging guide`_ for another explanation of the files and options used.
fa: برای توضیح دیگری درباره فایل‌ها و گزینه‌های استفاده شده، به `official packaging guide`_ مراجعه کنید.

source: Install the Project
fa: نصب پروژه

source: Use ``pip`` to install your project in the virtual environment.
fa: برای نصب پروژه خود در محیط مجازی از ``pip`` استفاده کنید.

source: This tells pip to find ``setup.py`` in the current directory and install it in *editable* or *development* mode. Editable mode means that as you make changes to your local code, you'll only need to re-install if you change the metadata about the project, such as its dependencies.
fa: این به pip می‌گوید ``setup.py`` را در فهرست فعلی پیدا کند و آن را در حالت *editable* یا *development* نصب کند. حالت قابل ویرایش به این معنی است که با ایجاد تغییرات در کد محلی خود، تنها در صورتی نیاز به نصب مجدد دارید که متادیتای پروژه، مانند وابستگی های آن را تغییر دهید.

source: You can observe that the project is now installed with ``pip list``.
fa: می توانید مشاهده کنید که پروژه اکنون با ``pip list`` نصب شده است.

source: Nothing changes from how you've been running your project so far. ``FLASK_APP`` is still set to ``flaskr`` and ``flask run`` still runs the application, but you can call it from anywhere, not just the ``flask-tutorial`` directory.
fa: هیچ چیز نسبت به نحوه اجرای پروژه خود تاکنون تغییر نکرده است. ``FLASK_APP`` همچنان روی ``flaskr`` تنظیم شده است و ``flask run`` همچنان برنامه را اجرا می‌کند، اما می‌توانید آن را از هرجایی فراخوانی کنید، نه فقط از دایرکتوری ``flask-tutorial`` .

source: Continue to :doc:`tests`.
fa: با :doc:`tests` ادامه دهید.
