Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/tutorial/layout.po
Languages: fa

source: Project Layout
fa: طرح بندی پروژه

source: Create a project directory and enter it:
fa: یک دایرکتوری برای پروژه بسازید و وارد آن شوید:

source: Then follow the :doc:`installation instructions </installation>` to set up a Python virtual environment and install Flask for your project.
fa: سپس :doc:`مقدمه نصب</installation>` را ببنید تا محیط های مجازی را راه‌اندازی کنید و فلاسک را برای پروژه خودتان نصب کنید.

source: The tutorial will assume you're working from the ``flask-tutorial`` directory from now on. The file names at the top of each code block are relative to this directory.
fa: این آموزش فرض میکند که شما الان در دایرکتوری ``flask-tutorial`` کار میکنید. اسم فایل ها در بالای هر قطعه کد است و در این دایرکتوری هستند.

source: A Flask application can be as simple as a single file.
fa: یک برنامه فلاسک میتواند ساده و یک فایل باشد.

source: However, as a project gets bigger, it becomes overwhelming to keep all the code in one file. Python projects use *packages* to organize code into multiple modules that can be imported where needed, and the tutorial will do this as well.
fa: با این حال، با بزرگتر شدن یک پروژه، نگه داشتن تمام کدها در یک فایل بسیار سخت می شود. پروژه‌های پایتون از *پکیج ها* برای سازماندهی کدها در چندین ماژول استفاده می‌کنند که می‌توانند در صورت نیاز وارد شوند و این آموزش این کار را میخواهد انجام دهد.

source: The project directory will contain:
fa: دایرکتوری پروژه شامل موارد زیر خواهد بود:

source: ``flaskr/``, a Python package containing your application code and files.
fa: ``flaskr/`` یک پکیج پایتون حاوی کد بزنامه شما و فایل ها است.

source: ``tests/``, a directory containing test modules.
fa: ``tests/`` یک دایرکتوری حاوی ماژول های تست است.

source: ``venv/``, a Python virtual environment where Flask and other dependencies are installed.
fa: ``venv/`` یک محیط مجازی پایتون است که فلاسک و سایر وابستگی ها در آنجا نصب هستند.

source: Installation files telling Python how to install your project.
fa: فایل های نصبی که به پایتون می گویند چگونه پروژه شما را نصب کند.

source: Version control config, such as `git`_. You should make a habit of using some type of version control for all your projects, no matter the size.
fa: شما باید عادت کنید که از هر نوع ورژن کنترلی برای پروژه های خود صرف نظر از اندازه آن استفاده کنید، مثل ورژن کنترل `git`_.

source: Any other project files you might add in the future.
fa: هر فایل پروژه دیگری که ممکن است در آینده اضافه کنید.

source: By the end, your project layout will look like this:
fa: در پایان، طرح پروژه شما به شکل زیر خواهد بود:

source: If you're using version control, the following files that are generated while running your project should be ignored. There may be other files based on the editor you use. In general, ignore files that you didn't write. For example, with git:
fa: اگر از کنترل نسخه استفاده می کنید، فایل های زیر که در حین اجرای پروژه شما تولید می شوند باید نادیده گرفته شوند. ممکن است فایل های دیگری بر اساس ویرایشگر مورد استفاده شما وجود داشته باشد. به طور کلی فایل هایی را که ننوشته اید نادیده بگیرید. به عنوان مثال، با git:

source: Continue to :doc:`factory`.
fa: با :doc:`factory` ادامه دهید.
