Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/tutorial/next.po
Languages: per

source: Keep Developing!
per: به توسعه ادامه دهید!

source: You've learned about quite a few Flask and Python concepts throughout the tutorial. Go back and review the tutorial and compare your code with the steps you took to get there. Compare your project to the :gh:`example project <examples/tutorial>`, which might look a bit different due to the step-by-step nature of the tutorial.
per: شما در طول آموزش با چند مفهوم فلاسک و پایتون آشنا شده اید. برگردید و آموزش را مرور کنید و کد خود را با مراحلی که برای رسیدن به آنجا طی کردید مقایسه کنید. پروژه خود را با :gh:`پروژه مثال <examples/tutorial>` مقایسه کنید، که ممکن است به دلیل ماهیت گام به گام آموزش کمی متفاوت به نظر برسد.

source: There's a lot more to Flask than what you've seen so far. Even so, you're now equipped to start developing your own web applications. Check out the :doc:`/quickstart` for an overview of what Flask can do, then dive into the docs to keep learning. Flask uses `Jinja`_, `Click`_, `Werkzeug`_, and `ItsDangerous`_ behind the scenes, and they all have their own documentation too. You'll also be interested in :doc:`/extensions` which make tasks like working with the database or validating form data easier and more powerful.
per: چیزهای بیشتری در فلاسک نسبت به آنچه تاکنون دیده اید وجود دارد. با این حال، شما اکنون برای شروع توسعه برنامه های کاربردی وب خود مجهز شده اید. برای مروری بر کارهایی که Flask می‌تواند انجام دهد، :doc:`/quickstart` را بررسی کنید، سپس برای ادامه یادگیری در اسناد شیرجه بزنید. فلاسک در پشت صحنه از `Jinja`_, `Click`_, `Werkzeug`_, و `ItsDangerous`_ استفاده می کند و همه آنها نیز مستندات خاص خود را دارند. شما همچنین به :doc:`/extensions` علاقه مند خواهید بود که کارهایی مانند کار با پایگاه داده یا اعتبارسنجی داده های فرم را آسان تر و قدرتمندتر می کند.

source: If you want to keep developing your Flaskr project, here are some ideas for what to try next:
per: اگر می‌خواهید به توسعه پروژه Flaskr خود ادامه دهید، در اینجا چند ایده برای آنچه در مرحله بعد امتحان کنید وجود دارد:

source: A detail view to show a single post. Click a post's title to go to its page.
per: نمایش جزئیات برای نمایش یک پست واحد. روی عنوان یک پست کلیک کنید تا به صفحه آن بروید.

source: Like / unlike a post.
per: لایک/آنلایک کردن یک پست.

source: Comments.
per: نظرات.

source: Tags. Clicking a tag shows all the posts with that tag.
per: برچسب ها. با کلیک بر روی یک برچسب، تمام پست های دارای آن برچسب نشان داده می شود.

source: A search box that filters the index page by name.
per: یک کادر جستجو که صفحه فهرست را بر اساس نام فیلتر می کند.

source: Paged display. Only show 5 posts per page.
per: صفحه نمایش. فقط 5 پست در هر صفحه نمایش داده شود.

source: Upload an image to go along with a post.
per: برای هر پست بتوان عکسی آپلود کرد.

source: Format posts using Markdown.
per: قالب بندی پست ها با استفاده از Markdown انجام شود.

source: An RSS feed of new posts.
per: فید RSS از پست های جدید وجود داشته باشد.

source: Have fun and make awesome applications!
per: از آن لذت ببرید و برنامه های عالی بسازید!
