Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/tutorial/static.po
Languages: fa

source: Static Files
fa: فایل های استاتیک

source: The authentication views and templates work, but they look very plain right now. Some `CSS`_ can be added to add style to the HTML layout you constructed. The style won't change, so it's a *static* file rather than a template.
fa: نماها و الگوهای احراز هویت کار می کنند، اما در حال حاضر بسیار ساده به نظر می رسند. مقداری `CSS`_ را می‌توان برای افزودن سبک به طرح‌بندی HTML که ساخته‌اید اضافه کرد. سبک تغییر نمی کند، بنابراین به جای یک الگو، یک فایل *استاتیک* است.

source: Flask automatically adds a ``static`` view that takes a path relative to the ``flaskr/static`` directory and serves it. The ``base.html`` template already has a link to the ``style.css`` file:
fa: فلاسک به طور خودکار یک نمای ``static`` را اضافه می کند که مسیری را نسبت به دایرکتوری ``flaskr/static`` می گیرد و آن را ارائه می کند. الگوی ``base.html`` قبلاً پیوندی به فایل ``style.css`` دارد:

source: Besides CSS, other types of static files might be files with JavaScript functions, or a logo image. They are all placed under the ``flaskr/static`` directory and referenced with ``url_for('static', filename='...')``.
fa: علاوه بر CSS، انواع دیگری از فایل‌های ثابت ممکن است فایل‌هایی با توابع جاوا اسکریپت یا یک تصویر لوگو باشند. همه آنها در فهرست ``flaskr/static`` قرار می گیرند و با ``url_for('static', filename='...')`` ارجاع داده می شوند.

source: This tutorial isn't focused on how to write CSS, so you can just copy the following into the ``flaskr/static/style.css`` file:
fa: این آموزش بر نحوه نوشتن CSS متمرکز نیست، بنابراین می‌توانید موارد زیر را در فایل ``flaskr/static/style.css`` کپی کنید:

source: You can find a less compact version of ``style.css`` in the :gh:`example code <examples/tutorial/flaskr/static/style.css>`.
fa: می‌توانید یک نسخه کم حجم از ``style.css`` را در :gh:`نمونه کد <examples/tutorial/flaskr/static/style.css>` بیابید.

source: Go to http://127.0.0.1:5000/auth/login and the page should look like the screenshot below.
fa: به http://127.0.0.1:5000/auth/login بروید و صفحه باید مانند تصویر زیر باشد.

source: screenshot of login page
fa: اسکرین شات از صفحه ورود

source: You can read more about CSS from `Mozilla's documentation <CSS_>`_. If you change a static file, refresh the browser page. If the change doesn't show up, try clearing your browser's cache.
fa: می‌توانید اطلاعات بیشتری درباره CSS را از `مستندات موزیلا <CSS_>`_ بخوانید. اگر یک فایل استاتیک را تغییر دادید، صفحه مرورگر را بازخوانی کنید. اگر تغییر نشان داده نشد، سعی کنید کش مرورگر خود را پاک کنید.

source: Continue to :doc:`blog`.
fa: با :doc:`blog` ادامه دهید.
