Repository: flaskcwg/flask-docs-fa
Catalog: docs/locales/*/LC_MESSAGES/tutorial/templates.po
Languages: fa

source: Templates
fa: قالب ها

source: You've written the authentication views for your application, but if you're running the server and try to go to any of the URLs, you'll see a ``TemplateNotFound`` error. That's because the views are calling :func:`render_template`, but you haven't written the templates yet. The template files will be stored in the ``templates`` directory inside the ``flaskr`` package.
fa: شما نماهای احراز هویت را برای برنامه خود نوشته اید، اما اگر سرور را اجرا می کنید و سعی می کنید به هر یک از URL ها بروید، خطای ``TemplateNotFound`` را مشاهده خواهید کرد. دلیلش این است که نماها :func:`render_template` را فراخوانی می کنند، اما شما هنوز الگوها را ننوشته اید. فایل‌های الگو در دایرکتوری ``templates`` در پکیج ``flaskr`` ذخیره می‌شوند.

source: Templates are files that contain static data as well as placeholders for dynamic data. A template is rendered with specific data to produce a final document. Flask uses the `Jinja`_ template library to render templates.
fa: قالب ها فایل هایی هستند که حاوی داده های ثابت و همچنین مکان هایی برای داده های پویا هستند. یک الگو با داده های خاص برای تولید یک سند نهایی ارائه می شود. Flask از کتابخانه الگوی `Jinja`_ برای ارائه الگوها استفاده می کند.

source: In your application, you will use templates to render `HTML`_ which will display in the user's browser. In Flask, Jinja is configured to *autoescape* any data that is rendered in HTML templates. This means that it's safe to render user input; any characters they've entered that could mess with the HTML, such as ``<`` and ``>`` will be *escaped* with *safe* values that look the same in the browser but don't cause unwanted effects.
fa: در برنامه خود، از الگوهایی برای رندر `HTML`_ استفاده خواهید کرد که در مرورگر کاربر نمایش داده می شود. در فلاسک و Jinja برای *گریز خودکار* هر داده ای که در قالب های HTML ارائه می شود پیکربندی شده است. این بدان معنی است که ارائه ورودی کاربر بی خطر است. هر کاراکتری که وارد کرده‌اند و می‌تواند با HTML به هم بخورد، مانند ``<`` و ``>`` با مقادیر *امن* که در مرورگر یکسان به نظر می‌رسند اما اثرات ناخواسته ایجاد نمی‌کنند و *حذف* می‌شوند.

source: Jinja looks and behaves mostly like Python. Special delimiters are used to distinguish Jinja syntax from the static data in the template. Anything between ``{{`` and ``}}`` is an expression that will be output to the final document. ``{%`` and ``%}`` denotes a control flow statement like ``if`` and ``for``. Unlike Python, blocks are denoted by start and end tags rather than indentation since static text within a block could change indentation.
fa: Jinja بیشتر شبیه پایتون به نظر می رسد و رفتار می کند. جداکننده‌های ویژه برای تشخیص سینتکس Jinja از داده‌های استاتیک در الگو استفاده می‌شوند. هر چیزی بین ``{{`` و ``}}`` عبارتی است که به سند نهایی خروجی می‌شود. ``{%`` و ``%}`` بیانگر یک دستور جریان کنترلی مانند ``if`` و ``for`` است. بر خلاف پایتون، بلوک‌ها با برچسب‌های شروع و پایان به جای تورفتگی مشخص می‌شوند، زیرا متن استاتیک درون یک بلوک می‌تواند تورفتگی را تغییر دهد.

source: The Base Layout
fa: طرح پایه

source: Each page in the application will have the same basic layout around a different body. Instead of writing the entire HTML structure in each template, each template will *extend* a base template and override specific sections.
fa: هر صفحه در برنامه دارای همان طرح اولیه در اطراف بدنه متفاوتی خواهد بود. به جای نوشتن کل ساختار HTML در هر قالب، هر الگو یک الگوی پایه را *بسط* می دهد و بخش های خاصی را لغو می کند.

source: :data:`g` is automatically available in templates. Based on if ``g.user`` is set (from ``load_logged_in_user``), either the username and a log out link are displayed, or links to register and log in are displayed. :func:`url_for` is also automatically available, and is used to generate URLs to views instead of writing them out manually.
fa: :data:`g` به طور خودکار در قالب ها موجود است. بر اساس اینکه ``g.user`` تنظیم شده باشد (از ``load_logged_in_user``)، یا نام کاربری و پیوند خروج نمایش داده می شود یا پیوندهایی برای ثبت نام و ورود به سیستم نمایش داده می شود. :func:`url_for` نیز به صورت خودکار در دسترس است و به جای نوشتن دستی، برای ایجاد URL برای بازدیدها استفاده می شود.

source: After the page title, and before the content, the template loops over each message returned by :func:`get_flashed_messages`. You used :func:`flash` in the views to show error messages, and this is the code that will display them.
fa: بعد از عنوان صفحه و قبل از محتوا، الگو روی هر پیامی که توسط :func:`get_flashed_messages` برگردانده می شود، حلقه می زند. شما از :func:`flash` در نماها برای نمایش پیام های خطا استفاده کردید و این کدی است که آنها را نمایش می دهد.

source: There are three blocks defined here that will be overridden in the other templates:
fa: سه بلوک در اینجا تعریف شده است که در سایر قالب ها لغو می شوند:

source: ``{% block title %}`` will change the title displayed in the browser's tab and window title.
fa: ``{% block title %}`` عنوان نمایش داده شده در برگه و عنوان پنجره مرورگر را تغییر می دهد.

source: ``{% block header %}`` is similar to ``title`` but will change the title displayed on the page.
fa: ``{% block header %}`` شبیه به ``title`` است اما عنوان نمایش داده شده در صفحه را تغییر می دهد.

source: ``{% block content %}`` is where the content of each page goes, such as the login form or a blog post.
fa: ``{% block content %}`` جایی است که محتوای هر صفحه مانند فرم ورود به سیستم یا یک پست وبلاگ قرار می گیرد.

source: The base template is directly in the ``templates`` directory. To keep the others organized, the templates for a blueprint will be placed in a directory with the same name as the blueprint.
fa: الگوی پایه مستقیماً در فهرست ``templates`` قرار دارد. برای سازماندهی سایر موارد، الگوهای یک طرح اولیه در فهرستی با همان نام طرح اولیه قرار می گیرند.

source: Register
fa: ثبت نام

source: ``{% extends 'base.html' %}`` tells Jinja that this template should replace the blocks from the base template. All the rendered content must appear inside ``{% block %}`` tags that override blocks from the base template.
fa: ``{% extensions 'base.html' %}`` به Jinja می‌گوید که این الگو باید جایگزین بلوک‌های الگوی پایه شود. تمام محتوای رندر شده باید در برچسب‌های ``{% block %}`` که بلوک‌های الگوی پایه را لغو می‌کنند، ظاهر شوند.

source: A useful pattern used here is to place ``{% block title %}`` inside ``{% block header %}``. This will set the title block and then output the value of it into the header block, so that both the window and page share the same title without writing it twice.
fa: یک الگوی مفید استفاده شده در اینجا، قرار دادن ``{% block title %}`` در داخل ``{% block header %}`` است. این بلوک عنوان را تنظیم می کند و سپس مقدار آن را در بلوک هدر خروجی می دهد، به طوری که پنجره و صفحه بدون دو بار نوشتن عنوان یکسانی را به اشتراک می گذارند.

source: The ``input`` tags are using the ``required`` attribute here. This tells the browser not to submit the form until those fields are filled in. If the user is using an older browser that doesn't support that attribute, or if they are using something besides a browser to make requests, you still want to validate the data in the Flask view. It's important to always fully validate the data on the server, even if the client does some validation as well.
fa: تگ‌های ``input`` از ویژگی ``required`` در اینجا استفاده می‌کنند. این به مرورگر می‌گوید تا زمانی که آن فیلدها پر نشده‌اند، فرم را ارسال نکند. اگر کاربر از مرورگر قدیمی‌تری استفاده می‌کند که آن ویژگی را پشتیبانی نمی‌کند، یا اگر از چیزی به غیر از مرورگر برای درخواست‌ها استفاده می‌کند، همچنان می‌خواهید اعتبارسنجی کنید. داده ها در نمای Flask مهم است که همیشه داده های روی سرور را به طور کامل اعتبار سنجی کنید، حتی اگر کلاینت اعتبارسنجی را نیز انجام دهد.

source: Log In
fa: وارد شدن

source: This is identical to the register template except for the title and submit button.
fa: این با الگوی ثبت نام به جز دکمه عنوان و ارسال یکسان است.

source: Register A User
fa: ثبت نام کاربر

source: Now that the authentication templates are written, you can register a user. Make sure the server is still running (``flask run`` if it's not), then go to http://127.0.0.1:5000/auth/register.
fa: اکنون که قالب های احراز هویت نوشته شده است، می توانید یک کاربر ثبت نام کنید. مطمئن شوید که سرور همچنان در حال اجراست (اگر اجرا نشده است ``flask run`` را بزنید)، سپس به http://127.0.0.1:5000/auth/register بروید.

source: Try clicking the "Register" button without filling out the form and see that the browser shows an error message. Try removing the ``required`` attributes from the ``register.html`` template and click "Register" again. Instead of the browser showing an error, the page will reload and the error from :func:`flash` in the view will be shown.
fa: سعی کنید بدون پر کردن فرم روی دکمه `Register` کلیک کنید و ببینید که مرورگر یک پیغام خطا نشان می دهد. سعی کنید ویژگی‌های ``required`` را از الگوی ``register.html`` حذف کنید و دوباره روی `Register` کلیک کنید. به جای اینکه مرورگر خطا را نشان دهد، صفحه دوباره بارگیری می شود و خطای :func:`flash` در نمای نمایش داده می شود.

source: Fill out a username and password and you'll be redirected to the login page. Try entering an incorrect username, or the correct username and incorrect password. If you log in you'll get an error because there's no ``index`` view to redirect to yet.
fa: نام کاربری و رمز عبور را پر کنید و به صفحه ورود هدایت می شوید. سعی کنید یک نام کاربری نادرست یا نام کاربری صحیح و رمز عبور نادرست وارد کنید. اگر وارد سیستم شوید با خطا مواجه می شوید زیرا هنوز نمای ``index`` برای تغییر مسیر وجود ندارد.

source: Continue to :doc:`static`.
fa: با :doc:`static` ادامه دهید.
